{"listings": [{"id": 11167860, "source": "linkedin", "position": "AWS DevOps Engineer - Source", "company": "trivago", "city": "Cologne Area", "country": ["Germany"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["agile", "analytics", "apache-kafka", "architecture", "ase", "aws", "cloud", "data", "design", "devops", "distributed-system", "docker", "etl", "git", "github", "go", "http", "infrastructure", "infrastructure-as-a-code", "kafka", "lambda", "lead", "networking", "next", "product", "python", "rust", "scala", "scripting", "security", "serverless", "streaming", "system", "vpc"], "category": "Developer", "epoch": 1570416176, "url": "https://de.linkedin.com/jobs/view/aws-devops-engineer-source-at-trivago-1492463852?refId=f5230031-557c-4f48-8204-18a837ccca42&position=13&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><p>Do you want to join a team of entrepreneurs from over 50 different nationalities? To work in an environment powered by passion where no two days are the same?<br/> </p><p><br/>At trivago we use the latest innovative technologies to empower our users to find their ideal hotel 100 times a second, across 55 different locales world-wide and in 33 different languages.<br/> </p><p><br/>At trivago's Hotel Search team, our aim is to help travellers to find their ideal hotel or vacation rental. To achieve this, we process, aggregate and deliver vast amounts of data from different sources (online travel agencies, hotel chains and hoteliers) on a daily base to make sure that our users only have the best and most relevant information to make a profound decision on their next booking.<br/> </p><p><br/> <br/> </p><p><br/>As a DevOps Engineer in Hotel Search, you will support our mission by helping us automate our infrastructure on the AWS platform, using the latest and greatest services and technologies. You will work in both hands-on engineering tasks, but also serve as technical consultant and adviser to several engineering teams to advocate the adoption of best practices in DevOps.<br/> </p><p><br/> <br/> </p><p><br/>Ready to take the next step in your career? This position will stretch you both professionally and personally. If you think you've got what it takes, read on and apply today!<br/> </p><p><br/> <br/> </p><p><br/>Get an inside look into tech at trivago:<br/> </p><p><br/> </p><p><br/>https://www.youtube.com/watch?v=aQYEsuGOs-s<br/> </p><p><br/> <br/> </p><p><br/><strong>What you'll do:<br/></strong> </p><p><strong><br/></strong> </p><ul><li><p>Be part of a cross-functional team of software/data engineers, product owners and project managers that directly impacts how millions of travellers find their ideal hotel.<br/> </p></li><li><p>As AWS expert, you are actively involved in the ideation and planning of projects and initiatives, both team-level and \"big picture\".<br/> </p></li><li><p>Design and implement scalable CI/CD data pipelines on AWS platform, using infrastructure as a code and technologies like Apache Kafka, Glue, Aurora/RDS, CloudWatch, Lambda, Kinesis, DynamoDB, S3, Redshift, Docker etc.<br/> </p></li><li><p>Plan and build modern solutions for access control, security, monitoring and data-backup management in the cloud.<br/> </p></li><li><p>Drive innovation and exchange knowledge with teams and peers in your area.<br/> </p></li></ul><p><br/> <br/> </p><p><br/><strong>What you'll need:<br/></strong> </p><p><strong><br/></strong> </p><ul><li><p>3+ years of experience as DevOps Engineer, Cloud Architect, or Systems Architect.<br/> </p></li><li><p>2+ years' experience with various AWS services, in-depth knowledge on CloudFormation and serverless architecture on AWS.<br/> </p></li><li><p>A Bachelor's degree in Computer Science, or (in case you're self-taught) outstanding references and an impressive Github profile.<br/> </p></li><li><p>Demonstrable experience in best practices of building monitoring and security on AWS cloud.<br/> </p></li><li><p>Good understanding of networking: TCP/IP, HTTP, DNS, NAT, VPN, VPCs etc.<br/> </p></li><li><p>A passion for delivering high-quality solutions that will improve productivity.<br/> </p></li><li><p>At least a minimal understanding of a programming or scripting language (preferably Python).<br/> </p></li><li><p>You speak English (our company language) fluently.<br/> </p></li></ul><p><br/> <br/> </p><p><br/><strong>What we'd love you to have:<br/></strong> </p><p><strong><br/></strong> </p><ul><li><p>You are and AWS certified Developer, DevOps Engineer or Solutions Architect.<br/> </p></li><li><p>You have knowledge/hands-on experience in distributed systems, ETL, big data analytics or streaming data technologies.<br/> </p></li><li><p>You have a proven track record delivering complex and high-impactful tech products to a large user base.<br/> </p></li><li><p>You are a skilful communicator, who can positively influence the people and teams they are working with in adopting DevOps best practices.<br/> </p></li></ul><p><br/> <br/> </p><p><br/><strong>What you can expect from life at trivago:<br/></strong> </p><p><strong><br/></strong> </p><ul><li><strong>Growth:</strong> We help you grow as trivago grows through support for personal and professional development, constant new challenges, regular peer-feedback, mentorship and world-class training. </li><li><strong>Autonomy: </strong>Every talent has the ability to make an impact independently by driving topics thanks to our strong entrepreneurial mindset, our horizontal workflow and self-determined working hours. </li><li><strong>International environment:</strong> Our agile, international culture and environment with talents from 50+ nations encourages mutual trust and creates a safe space to discuss openly and act freely. </li><li><strong>Collaborative spaces:</strong> Our state-of-the-art campus in Düsseldorf offers interactive spaces where we can easily collaborate, exchange ideas, take a break and workout together. </li><li><strong>Relocation:</strong> We offer our international talents support with relocation costs, work permit and visa questions, free language classes, flat search and insurance. </li></ul><p><br/> </p><p><br/> </p><p><br/><strong>Additional information:<br/></strong> </p><p><strong><br/></strong> </p><ul><li><p>trivago N.V. is proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better product for our users. </p></li><li><p>To find out more about life at trivago follow us on social media @lifeattrivago. </p></li><li><p>Want to learn more about trivago's business model to prepare for your interview? Visit https://company.trivago.com/our-product/. </p></li><li><p>To learn more about tech at trivago, check out our blog: <u>https://tech.trivago.com/</u></p></li></ul></div>"}, {"id": 11266230, "source": "linkedin", "position": "Python Software Engineer - Personalization", "company": "trivago", "city": "Düsseldorf", "country": ["Germany"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["agile", "architecture", "ase", "automation", "aws", "data", "data-structures", "design", "design-patterns", "distributed-system", "excel", "gcp", "go", "http", "java", "jvm", "lead", "open-source", "product", "python", "rust", "scala", "spark", "system", "types"], "category": "Developer", "epoch": 1569465779, "url": "https://de.linkedin.com/jobs/view/python-software-engineer-personalization-at-trivago-1521345966?refId=a4bdc0c9-49d0-4d78-bf3d-7361ee0bb8aa&position=21&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><p><br/>Do you want to join a team of entrepreneurs from over 50 different nationalities? To work in an environment powered by passion where no two days are the same?<br/></p><p><br/>At trivago we use the latest innovative technologies to empower our users to find their ideal hotel 100 times a second, across 55 different locales world-wide and in 33 different languages.<br/></p><p><br/>\"<em>I want a hotel with nightlife, an infinity pool, gourmet food, a sparkling clean room, and a balcony with a view of the ocean.</em>\" This statement exemplifies the types of desires our users have on trivago and our User Profiling team is responsible for knowing and processing what these desires are. This understanding is essential for the optimization of every part of the user's journey on our platform. <br/></p><p><br/> <br/></p><p><br/>Working in User Profiling, you'll have the opportunity to take on this challenge from multiple angles in order to enrich our understanding of our users. You might find yourself working on anything from understanding natural language search queries from the moment users land on trivago and begin to type, to dynamically personalizing their hotel search results in near-real time, or even helping users to discover hotels that offer amenities as exciting as an infinity pool.<br/></p><p><br/> <br/></p><p><br/>Does predicting the travel desires of millions of trivago users sound exciting? If so, then this is the right position for you ─ read on and apply today!<br/></p><p><br/> <br/></p><p><br/> <br/></p><p><br/>Get an inside look into tech at trivago:<br/></p><p><br/> <br/></p><p><br/>https://www.youtube.com/watch?v=aQYEsuGOs-s<br/></p><p><br/> <br/></p><p><br/><strong>What you'll do:<br/></strong></p><ul><li>Provide 4 million daily visitors with their ideal hotel through personalization.</li><li>Contribute to key architecture decisions affecting multiple teams.</li><li>Build innovative features while writing clean, composable, and testable code.</li><li>Combine different technologies to design and implement efficient and high performing data-intensive systems.</li><li>Be creative, challenge yourself and spread the word: Contribute back to open source projects or open-source something yourself.</li><li>Elevate the output of a cross-functional team by facilitating communication between data scientists, software engineers, project managers, and other passionate experts.</li></ul><p><br/> <br/></p><p><br/><strong>What you'll need:<br/></strong></p><ul><li>An academic degree in the field of Computer Science or relevant experience developing large applications.</li><li>At least 2 years of experience in software development using Python, ideally in a high-performance web environment.</li><li>Excellent knowledge of software architecture, data structures and modern design patterns.</li><li>The ability to break down large goals and design solutions into actionable steps with maintainability as a priority.</li><li>Enthusiasm for sharing knowledge with other people in and outside the team.</li><li>A strong understanding of English, our official company language.</li></ul><p><br/> <br/></p><p><br/><strong>What we would love you to have:<br/></strong></p><ul><li>A solid understanding of distributed systems and their principles such as reliability, scalability, and resilience.</li><li>Experience with Java or JVM based technologies.</li><li>A passion for good development practices like test automation, CI/CD, source version control, documentation etc.</li><li>Previous experience with AWS or GCP.</li></ul><p><br/> <br/></p><p><br/><strong>What to expect from life at trivago:<br/></strong></p><ul><li><strong>Growth:</strong> We help you grow as trivago grows through support for personal and professional development, constant new challenges, regular peer-feedback, mentorship and world-class training.</li><li><strong>Autonomy: </strong>Every talent has the ability to make an impact independently by driving topics thanks to our strong entrepreneurial mindset, our horizontal workflow and self-determined working hours.</li><li><strong>International environment:</strong> Our agile, international culture and environment with talents from 50+ nations encourages mutual trust and creates a safe space to discuss openly and act freely.</li><li><strong>Collaborative spaces:</strong> Our state-of-the-art campus in Düsseldorf offers interactive spaces where we can easily collaborate, exchange ideas, take a break and workout together.</li><li><strong>Relocation:</strong> We offer our international talents support with relocation costs, work permit and visa questions, free language classes, flat search and insurance.</li></ul><p><br/> <br/></p><p><br/><strong>Additional information:<br/></strong></p><ul><li>trivago N.V. is proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better product for our users.</li><li>To find out more about life at trivago follow us on social media @lifeattrivago.</li><li>To learn more about tech at trivago, check out our blog: https://tech.trivago.com/</li><li>Want to learn more about trivago's business model to prepare for your interview? Visit https://company.trivago.com/our-product/<br/></li></ul></div>"}, {"id": 11408735, "source": "linkedin", "position": "Senior Mobile-Developer iOS / Swift (Visum-Sponsor) (m/w/d)", "company": "InStaff & Jobs GmbH", "city": "Berlin, Berlin", "country": ["Germany"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["algorithm", "api", "architecture", "data", "debugging", "design", "design-patterns", "git", "go", "ios", "iphone", "java", "lead", "machine-learning", "mobile", "next", "objective-c", "operating-system", "product", "react", "reactive-programming", "rest", "rxswift", "software-design", "swift", "system"], "category": "Developer", "epoch": 1570156985, "url": "https://de.linkedin.com/jobs/view/senior-mobile-developer-ios-swift-visum-sponsor-m-w-d-at-instaff-jobs-gmbh-1333174865?refId=bb945cd4-499b-496d-80b1-7270fdd227de&position=14&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong>THESE ARE YOUR TASKS</strong><p><br/> </p><p>You are able to build fast, elegant and powerful mobile apps, that can access device hardware, communicate with a Restful API and cache as well as synchronize data locally? You already have experience in Reactive Programming and in building modern iOS apps? We are looking for ambitious mobile developers to join our fast growing online marketplace.<br/><br/>We are currently a team of 36 people who are working in the heart of Berlin. We keep growing and plan to hire 1-2 other mobile developers in the next 3 months.<br/>Our product roadmap includes:<br/><br/><ul><li>Native mobile applications so our jobbers can manage their applications on the go </li><li>Modern Rest API that enables our customers to manage their short term staff via the API </li><li>Scoring algorithm that uses Machine learning techniques to rate the reliability of our jobbers </li><li>A free to use shift-planning software that generates leads for our staffing marketplace </li></ul><p><br/> </p><p><br/> </p><p><br/> </p><p><strong>WHAT YOU BRING</strong> </p><p><strong><br/></strong> </p><ul><li>2 years experience in native development for iOS (ideally with an application in the iOS App Store) </li><li>Experience in Reactive Programming (e.g. RxSwift or RxJava) </li><li>Solid knowledge in Swift and / or Objective C </li><li>Solid knowledge of software design patterns and good architecture </li><li>Deep understanding of the iOS operating system and ecosystem </li><li>Familiarity with RESTful APIs </li><li>Great skills in analyzing, debugging and resolving defects </li><li>Proficiency in code versioning with git </li><li>Fluency in written and spoken English </li></ul><p><br/> </p><strong>Bonus points for</strong><ul><li>Experience with mobile tracking frameworks </li><li>Experience with Machine Learning / AI algorithms </li><li>Experience with managing a mobile development team </li></ul><p><br/> </p><p><br/> </p><p><br/> </p><p><strong>WHAT WE OFFER</strong> </p><p><strong><br/></strong> </p><ul><li>Very competitive salary between 50k and 60k EUR depending on your experience </li><li>We sponsor your visa if you are not an EU resident and accompany you during the visa process </li><li>Once you arrive, we help you set up everything to get started: Registration, Bank Account, Health Insurance, Tax and Social Tax ID, etc. </li><li>You will work with the latest equipment, including a MacBook Pro, iPhone X and additional gadgets / tech equipment you like to use (headphone, monitor, etc.) </li><li>You work in our spacious office in the heart of Berlin (near Checkpoint Charlie) </li><li>You have flexible working hours </li><li>Twice a week, we offer free lunch for the whole company </li><li>Twice a week we offer free professional fitness training outside of our office </li><li>Twice a week you can participate in a free German language course during working hours </li><li>We have free company fun events about once per quarter</li></ul></p></div>"}, {"id": 11847877, "source": "linkedin", "position": "Global Head of Data Science – Bangkok based", "company": "Agoda", "city": "Bangkok", "country": ["Thailand"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["algorithm", "ase", "automation", "data", "data-processing", "data-science", "deep-learning", "design", "erp", "go", "ida", "lead", "leader", "machine-learning", "nlp", "open-source", "product", "rust", "scale", "statistics", "system", "testing"], "category": "Data-Science", "epoch": 1570070593, "url": "https://uk.linkedin.com/jobs/view/global-head-of-data-science-%E2%80%93-bangkok-based-at-agoda-1535672453?refId=a2797802-998a-4e1a-aa64-c8c161bec430&position=19&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">Agoda is one of the world’s largest and fastest growing online travel agents. Coming from over 70+ countries, our 5,000-plus person team is young, energetic, and hyper-focused on every last detail of the travel experience. Our parent company, Booking Holdings, owns several other premier travel brands, including Booking.com, Priceline.com, Kayak, and OpenTable.com, making us the largest and fastest growing travel portfolio in the world. But the group is focused on entrepreneurialism, and each brand operates independently, allowing us to experiment and move fast.<br/><br/>Our 25-strong Data Science team is already responsible for a big portion of our success, we deploy ML across the board. Our marketing automation is managing a budget of 100Ms$ with automated bidding, our recommendation and ranking engines give billions of predictions a day based on deep learning models running in production. Our NLP lab is perfecting the chat engine in order to reduce customer frustration and there are many other examples, including fraud, pricing, experimentation, anomaly detection etc. All of this is running on our home-grown data platform, currently collecting 1.2 trillion data points every day.<br/><br/>But we are still not satisfied<br/><br/>So far, we have been using Data Science to *improve* the product, but now it’s time for a revolution. We want to use data science in every aspect of the product, front or back, make it clear to the customer that we are giving them a superb experience from all aspects and empower the entirety of our tech team to utilize our data in real time.<br/><br/>A vision like this requires a leader that can combine strategy, execution, communication and intelligence to take materialize these ideas all the way to the customer, are you that person?<br/><br/><strong><u>As The Global Head Of Data Science, You Will<br/><br/></u></strong><strong>Manage and grow our DS teams,</strong> our team is mostly MSc and PhD graduates from top universities around the world, including Stanford, Harvard and others. Talent is the key to a success in data science and we need to make sure we keep our strong team engaged and motivated while growing it<br/><br/><strong>Drive revolutionary initiatives</strong>. you will be responsible for the company future by making sure we are in front of the innovation curve. We will go into projects that have not been done before at our scale, this will require world-class data science but also the ability to communicate effectively with senior management and get them on board. Agoda is a well-tuned machine and any change is tested, making big steps requires careful planning to make sure we eventually follow the customer needs.<br/><br/><strong>Deliver results. </strong>As the head of the data science team, you are responsible for our success across all products, sometimes that means understanding why some models aren’t working as expected, sometimes it’s about having the right people on the right projects and sometimes is some dependent system that we need to augment in order to achieve our goals. In any case, the responsibility and <strong>ownership</strong> is on you to get the desired outcome<br/><br/><strong>Build for the future. </strong>These are exciting days for data science and machine learning, new technology pops up every few days, from modeling to data processing to orchestration it’s clear that there’s currently no one “right way to do it”. Agoda has always been a very independent company, we want to control our fate and our technology so we almost never use “enterprise software” and rely mostly on open source that we can tweak and contribute back to. You’ll be responsible our strategic technical roadmap for data science, thinking about problem like measuring model’s health, centralized feature stores, orchestrating model deployment and others.<br/><br/><strong>Work in one of Asia’s most vibrant cities.</strong> Bangkok provides a setting like no other: edgy, luxurious, impossibly sensorial, endlessly layered. The perfect junction of a globally minded career and the heart of Asian travel.<br/><br/><strong><u>What You’ll Get The Chance To Do<br/></u></strong><ul> <li>Lead the managers of the different DS teams across 3 different offices (Bangkok, Singapore and Israel). Mentor them to grow and develop their teams</li> <li>Oversee the execution of all DS related initiatives and projects from initiation to production and beyond</li> <li>Join senior management in key discussion to facilitate a scientific approach in key decisions and raise new initiatives</li> <li>Interface with all business and product units to help shape the future of the product and find the opportunities where DS can be helpful</li> <li>Drive a culture of science and ML in the company, plan how to educate and train our 1200 people tech team to utilize DS in every aspect of our products</li> <br/><br/></ul><strong><u>What You Bring<br/></u></strong><ul> <li>Vast analytical problem-solving capabilities &amp; experience.</li> <li>Experience in leading teams of data scientists and data engineers, preferably in an ecommerce, tech, advertising or management consulting environment.</li> <li>Strong knowledge in Statistics, DS and ML practices and technologies, specifically in big data environments</li> <li>Strong understanding and implementation experience of predictive modeling algorithms such as regressions, time series, neural networks, clustering, decision trees and heuristic models, with familiarity dealing with tradeoffs between model performance and business needs.</li> <li>Experienced with planning and managing ML projects in real time environments with incremental testing capabilities.</li> <li>Fantastic communication skills that enable you to work cross-functionally with product managers, tech geeks and design gurus, building solid relationships with a diverse set of stakeholders.</li> <li>The ability to convey complex solutions to a less technical person.</li> <li>Bias for action.</li> <li>Advanced degree (MSc/PhD) in Computer Science, Economics, Engineering, Operations Research, Physics or Mathematics/Statistics preferred.</li> <br/><br/></ul><strong>This position is open to worldwide and local candidates and we will assist you with a generous relocation package and visa sponsorship ensuring a smooth transition to working and living in Bangkok.<br/><br/></strong>#shanghai #beijing #sanfrancisco #sanjose #losangeles #sandiego #oakland #miami #orlanda #boston #seattle #newyork #telaviv #manchester #london #liverpool #york #dublin #sydney #melbourne #IT #4<br/><br/></div>"}, {"id": 11692011, "source": "linkedin", "position": "Software Engineer JavaScript", "company": "trivago", "city": "Düsseldorf", "country": ["Germany"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["agile", "architecture", "ase", "go", "http", "java", "javascript", "js", "lead", "libraries", "product", "redux", "rust", "user-experience", "webpack"], "category": "Developer", "epoch": 1570502605, "url": "https://de.linkedin.com/jobs/view/software-engineer-javascript-at-trivago-1543787826?refId=f5230031-557c-4f48-8204-18a837ccca42&position=14&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">JavaScript is a central technology of the trivago Hotel Search. Faced with high performance requirements, our JavaScript engineers work relentlessly on speeding up the application while keeping the code modular and maintainable.<br/><br/>We are currently looking for a JavaScript Software Engineer to apply their analytical and methodical way of working to our codebase. Are you an innovative thinker? Do you create solid architectures that are well-structured and extensible? Can you keep our applications snappy and responsive despite the growing amount of features? Then we should definitely talk!<br/><br/>Meet Patrick to get a sneak peek of who you will be working with:<br/><br/><strong><u>Your Responsibilities<br/></u></strong><ul> <li> Create an amazing experience for millions of users.</li> <li> Participate in architecture decisions and innovative feature development tasks.</li> <li> Work in a cross-functional team with passionate experts from various fields.</li> <li> Write clean, composable, and testable code.</li> <li> Stay up to date with current frameworks, tools, techniques and libraries.</li> <li> Optimize our code for various browsers and connection speeds.</li> <br/><br/></ul><strong><u>Our Technology Stack<br/></u></strong><ul> <li> Babel</li> <li> Webpack</li> <li> Jest</li> <li> Redux</li> <li> Rx.js</li> <br/><br/></ul><strong><u>Essential Requirements<br/></u></strong><ul> <li>You seek to constantly learn and improve —we will help by providing external and internal trainings.</li> <li>An academic degree in the field of IT or relevant experience with</li> <li>You speak English fluently.</li> <li>You are a team player and enjoy working with people</li> <li>You are an advocate for a great user experience</li> <br/><br/></ul><strong><u>What You Can Expect From Life At Trivago<br/></u></strong><ul> <li><strong>Growth: </strong>We help you grow as trivago grows through support for personal and professional development, constant new challenges, regular peer-feedback, mentorship and world-class training.<br/></li> <li><strong>Autonomy: </strong>Every talent has the ability to make an impact independently by driving topics thanks to our strong entrepreneurial mindset, our horizontal workflow and self-determined working hours.</li> <li><strong>International environment:</strong> Our agile, international culture and environment with talents from 50+ nations encourages mutual trust and creates a safe space to discuss openly and act freely. </li> <li><strong>Collaborative spaces:</strong> Our state-of-the-art campus in Düsseldorf offers interactive spaces where we can easily collaborate, exchange ideas, take a break and workout together. </li> <li><strong>Relocation:</strong> We offer our international talents support with relocation costs, work permit and visa questions, free language classes, flat search and insurance.</li> <br/><br/></ul><strong><u>Additional Information<br/></u></strong><ul> <li>trivago N.V. is proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better product for our users.</li> <li>To find out more about life at trivago follow us on social media @lifeattrivago.</li> <li>To learn more about tech at trivago, check out our blog: https://tech.trivago.com/</li></ul></div>"}, {"id": 11329315, "source": "linkedin", "position": "Mobile Game Developer (Unity)", "company": "Bee Square Games", "city": "Barcelona", "country": ["Spain"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["agile", "algorithm", "ase", "design", "design-patterns", "go", "graphics", "ida", "mobile", "open-source", "product", "scripting", "scrum", "system", "unity3d", "user-interface"], "category": "Developer", "epoch": 1570070608, "url": "https://es.linkedin.com/jobs/view/mobile-game-developer-unity-at-bee-square-games-1533330432?refId=43ec9935-a347-4e1c-a0de-0e89a21b0777&position=5&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Job Description<br/><br/></u></strong>Bee Square is expanding! We are looking for a client­-side Unity Programmer for mobile platforms. The ideal candidate will have deep experience with game development with a strong computer science background.<br/><br/><strong><u>What We Are Looking For<br/><br/></u></strong>Professional, passionate about games, problem solving, proactive, team worker, rigorous and detail oriented. You are smart, willing to learn more, creative and practical at the same time.<br/><br/><strong><u>What We Offer<br/></u></strong><ul><li> Paid relocation and visa assistance. </li><li> Working with an international and high profile team. </li><li> Competitive salary. </li><li> Performance-based bonus system. </li><li> Sodexo meal card. </li><li> A kitchen filled with free coffee, tea, juices, fruit, cereals, cakes, chocolate, etc. </li><li> Play area (consoles, free coin­ops). </li><li> Gym membership sponsoring. </li><li> Option to customize your work environment to your liking. </li><li> Office with a big sunny terrace located in the heart of Barcelona. <br/><br/></li></ul><strong><u>Desired Skills And Experience<br/></u></strong><ul><li> Previous game development experience (around 3 years of experience at least, and one game shipped). </li><li> Experience with Unity3D and C# language. </li><li> Strong skills writing well organized and clean code. </li><li> Strong knowledge of basic design patterns, especially ECS and MVC. </li><li> Strong knowledge of performance and memory optimizations in Unity. </li><li> Ability to work fast, quickly get up to speed with existing code and learn new concepts easily. </li><li> Extensive knowledge of object ­oriented programming and software engineering. </li><li> Great understanding of algorithms and techniques used in games, related with: AI, physics, user interface, scripting, audio, server communication. </li><li> Solid understanding of 2D/3D graphics and math involved in computer games. </li><li> Desire to create fun games which you will also enjoy playing. </li><li> Ability to quickly adapt to design changes. <br/><br/></li></ul><strong><u>Plus<br/></u></strong><ul><li> Strong understanding of free to play market and game design. </li><li> Previous experience releasing independent projects. </li><li> Involvement in open source projects and game jams. </li><li> Experience in a multiplayer project. </li><li> An eye for quality and polished products. </li><li> Experience with agile, scrum or Kanban development. </li><li> Experience in writing shaders for mobile games. <br/><br/></li></ul><strong><u>Note<br/><br/></u></strong>Candidates who match all requirements will be asked to solve game related algorithms in a skype interview, and provide either previous open source projects or build a simple game project within 2 days.</div>"}, {"id": 11847877, "source": "linkedin", "position": "Global Head of Data Science – Bangkok based", "company": "Agoda", "city": "Bangkok", "country": ["Thailand"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["algorithm", "ase", "automation", "data", "data-processing", "data-science", "deep-learning", "design", "erp", "go", "ida", "lead", "leader", "machine-learning", "nlp", "open-source", "product", "rust", "scale", "statistics", "system", "testing"], "category": "Data-Science", "epoch": 1570070610, "url": "https://uk.linkedin.com/jobs/view/global-head-of-data-science-%E2%80%93-bangkok-based-at-agoda-1535671452?refId=a2797802-998a-4e1a-aa64-c8c161bec430&position=1&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">Agoda is one of the world’s largest and fastest growing online travel agents. Coming from over 70+ countries, our 5,000-plus person team is young, energetic, and hyper-focused on every last detail of the travel experience. Our parent company, Booking Holdings, owns several other premier travel brands, including Booking.com, Priceline.com, Kayak, and OpenTable.com, making us the largest and fastest growing travel portfolio in the world. But the group is focused on entrepreneurialism, and each brand operates independently, allowing us to experiment and move fast.<br/><br/>Our 25-strong Data Science team is already responsible for a big portion of our success, we deploy ML across the board. Our marketing automation is managing a budget of 100Ms$ with automated bidding, our recommendation and ranking engines give billions of predictions a day based on deep learning models running in production. Our NLP lab is perfecting the chat engine in order to reduce customer frustration and there are many other examples, including fraud, pricing, experimentation, anomaly detection etc. All of this is running on our home-grown data platform, currently collecting 1.2 trillion data points every day.<br/><br/>But we are still not satisfied<br/><br/>So far, we have been using Data Science to *improve* the product, but now it’s time for a revolution. We want to use data science in every aspect of the product, front or back, make it clear to the customer that we are giving them a superb experience from all aspects and empower the entirety of our tech team to utilize our data in real time.<br/><br/>A vision like this requires a leader that can combine strategy, execution, communication and intelligence to take materialize these ideas all the way to the customer, are you that person?<br/><br/><strong><u>As The Global Head Of Data Science, You Will<br/><br/></u></strong><strong>Manage and grow our DS teams,</strong> our team is mostly MSc and PhD graduates from top universities around the world, including Stanford, Harvard and others. Talent is the key to a success in data science and we need to make sure we keep our strong team engaged and motivated while growing it<br/><br/><strong>Drive revolutionary initiatives</strong>. you will be responsible for the company future by making sure we are in front of the innovation curve. We will go into projects that have not been done before at our scale, this will require world-class data science but also the ability to communicate effectively with senior management and get them on board. Agoda is a well-tuned machine and any change is tested, making big steps requires careful planning to make sure we eventually follow the customer needs.<br/><br/><strong>Deliver results. </strong>As the head of the data science team, you are responsible for our success across all products, sometimes that means understanding why some models aren’t working as expected, sometimes it’s about having the right people on the right projects and sometimes is some dependent system that we need to augment in order to achieve our goals. In any case, the responsibility and <strong>ownership</strong> is on you to get the desired outcome<br/><br/><strong>Build for the future. </strong>These are exciting days for data science and machine learning, new technology pops up every few days, from modeling to data processing to orchestration it’s clear that there’s currently no one “right way to do it”. Agoda has always been a very independent company, we want to control our fate and our technology so we almost never use “enterprise software” and rely mostly on open source that we can tweak and contribute back to. You’ll be responsible our strategic technical roadmap for data science, thinking about problem like measuring model’s health, centralized feature stores, orchestrating model deployment and others.<br/><br/><strong>Work in one of Asia’s most vibrant cities.</strong> Bangkok provides a setting like no other: edgy, luxurious, impossibly sensorial, endlessly layered. The perfect junction of a globally minded career and the heart of Asian travel.<br/><br/><strong><u>What You’ll Get The Chance To Do<br/></u></strong><ul> <li>Lead the managers of the different DS teams across 3 different offices (Bangkok, Singapore and Israel). Mentor them to grow and develop their teams</li> <li>Oversee the execution of all DS related initiatives and projects from initiation to production and beyond</li> <li>Join senior management in key discussion to facilitate a scientific approach in key decisions and raise new initiatives</li> <li>Interface with all business and product units to help shape the future of the product and find the opportunities where DS can be helpful</li> <li>Drive a culture of science and ML in the company, plan how to educate and train our 1200 people tech team to utilize DS in every aspect of our products</li> <br/><br/></ul><strong><u>What You Bring<br/></u></strong><ul> <li>Vast analytical problem-solving capabilities &amp; experience.</li> <li>Experience in leading teams of data scientists and data engineers, preferably in an ecommerce, tech, advertising or management consulting environment.</li> <li>Strong knowledge in Statistics, DS and ML practices and technologies, specifically in big data environments</li> <li>Strong understanding and implementation experience of predictive modeling algorithms such as regressions, time series, neural networks, clustering, decision trees and heuristic models, with familiarity dealing with tradeoffs between model performance and business needs.</li> <li>Experienced with planning and managing ML projects in real time environments with incremental testing capabilities.</li> <li>Fantastic communication skills that enable you to work cross-functionally with product managers, tech geeks and design gurus, building solid relationships with a diverse set of stakeholders.</li> <li>The ability to convey complex solutions to a less technical person.</li> <li>Bias for action.</li> <li>Advanced degree (MSc/PhD) in Computer Science, Economics, Engineering, Operations Research, Physics or Mathematics/Statistics preferred.</li> <br/><br/></ul><strong>This position is open to worldwide and local candidates and we will assist you with a generous relocation package and visa sponsorship ensuring a smooth transition to working and living in Bangkok.<br/><br/></strong>#shanghai #beijing #sanfrancisco #sanjose #losangeles #sandiego #oakland #miami #orlanda #boston #seattle #newyork #telaviv #manchester #london #liverpool #york #dublin #sydney #melbourne #IT #4<br/><br/></div>"}, {"id": 11278310, "source": "linkedin", "position": "Back End Engineer (Search)", "company": "Agoda", "city": "Bangkok", "country": ["Thailand"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["activemq", "akka", "algorithm", "api", "architecture", "clojure", "data", "data-structures", "design", "design-patterns", "elasticsearch", "functional-programming", "go", "java", "jvm", "kafka", "kotlin", "lead", "mysql", "nosql", "oracle", "product", "rabbitmq", "rest", "scala", "sql", "sql-server", "system"], "category": "Back-End", "epoch": 1569465819, "url": "https://jp.linkedin.com/jobs/view/back-end-engineer-search-at-agoda-1117356893?refId=f045aa12-6fc0-446a-9dcb-ef334f861160&position=2&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><em><strong>This is a full time position working on site in our office in Bangkok. Full relocation and Visa sponsorship is providedd.<br/><br/></strong></em><strong><u>Overview<br/><br/></u></strong>Agoda is the largest and fastest growing online hotel booking platform in Asia and as a Booking Holdings company, we are part of the largest online travel company in the world. Technology is not just what we do – it’s at the heart of who we are. We have the dynamism and short chain of command of a start-up and the capital to make things happen. We love innovation and putting new technologies to work to extend our lead on the competition.<br/><br/>Working in one of the largest international Internet employers headquartered in Asia, your work has an impact on what we do around the globe. We move fast – why wait ages to see your ideas go live? Work on tough challenges, safe in the knowledge that you are surrounded by people as smart as you are (if not smarter!) to help solve them. And while we’re on the subject, Agoda people come from over 70+ countries: It’s an incredible technical creative melting pot.<br/><br/>What’s stopping you from getting in touch?<br/><br/><strong><u>Are You<br/></u></strong><ul> <li>Top-notch developer with extensive knowledge in Scala, Java or Kotlin?</li> <li>You have a strong background in design and implementation of scalable architecture and a good understanding of Algorithms, Data structures and design patterns?</li> </ul><ul> <li>You strive to produce high quality, maintainable code with high test coverage and are comfortable with a culture of peer reviewing.</li> </ul><ul> <li>Hungry to learn new tools, languages and technologies? </li> <br/><br/></ul><strong><u>Responsibilities<br/><br/></u></strong>Agoda Platform team is looking for developers to work on mission critical systems that deal with the designing and development of APIs that serve millions of user search requests a day.<br/><br/><strong><u>Qualifications<br/><br/></u></strong><strong>What we are looking for<br/></strong><ul> <li>You will have 5+ years’ experience developing performance-critical applications that run in a production environment using a core JVM technology.</li> <li>You have knowledge in one or more of the following: NoSQL (especially, but not only ElasticSearch), Queueing systems (Kafka, RabbitMQ, ActiveMQ), Akka library.</li> <li>Previous experience with Scala/Clojure or applying functional programming patterns.</li> <li>You have RDBMS knowledge (SQL Server, Oracle, MySql or other)</li> <li>You have a good command of the English language.</li> <br/><br/></ul><strong><u>What We Can Offer<br/></u></strong><ul> <li>Work for a profitable business with the atmosphere of a fun start-up.</li> <li>Work on interesting problems with a high degree of autonomy.</li> <li>Competitive salary and benefits.</li> <li>Role open to local and international applications - full visa sponsorship and relocate package available.</li> <br/><br/></ul><strong>We are happy to receive CV's from both international &amp; local applicants as we offer relocation assistance and visa sponsorship for eligible persons.<br/><br/></strong>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status or disability status.<br/><br/>#sanfrancisco #sanjose #losangeles #sandiego #oakland #miami #orlanda #boston #seattle #newyork #shanghai #beijing #shenzhen #telaviv #moscow #seoul #tokyo #london #manchester #IT #4<br/><br/></div>"}, {"id": 11201309, "source": "linkedin", "position": "Android Developer (m/f/d)", "company": "SIXT", "city": "Munich", "country": ["Germany"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["agile", "analytics", "android", "android-jetpack", "api", "architecture", "ase", "automation", "backend", "bluetooth", "cloud", "continuous-integration", "dependency-injection", "design", "git", "github", "go", "gradle", "integration", "java", "js", "junit", "kotlin", "lead", "mobile", "product", "rest", "retrofit", "scale", "scrum", "system", "testing", "unit-testing"], "category": "Developer", "epoch": 1570329827, "url": "https://de.linkedin.com/jobs/view/android-developer-m-f-d-at-sixt-1482205475?refId=bb945cd4-499b-496d-80b1-7270fdd227de&position=8&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">For our Mobile Development Team in Munich, we are currently looking for a highly motivated Android Developer (m/f/d). Are you passionate about coding in Kotlin and Java? If Activities, Fragments, Intents and Services sweeten your Marshmallow and you like to have some Oreos and Pie with your coffee, send us an email with your CV and links to your existing projects in Google Play, or Github repositories if you have any. Besides having solid Android knowledge, ideally you are experienced in one or more of the following topics: Restful APIs with JSON, unit testing and test automation, continuous integration, git and Gradle. We need your creativity and ambition relating to smartphones, tablets, wearables, AI and more! Join us and contribute to our SIXT Apps and Rent/Share/Ride products creating excitement for our customers at an international scale. You will get to interact with like-minded mobile experts in our own mobile development blog and participate in dev-guilds and regular hacking days, giving you the chance to expand your knowledge of the platforms. We will provide you with the suitable setting that includes a foosball, great coffee, Club Mate and regular team events. We are coding the future of mobility! SIXT stands for success, agility, ownership and an intercultural team. Apply now, join our journey and become a part of the SIXT family.<br/><br/><strong><u>Do What You Love<br/></u></strong><ul> <li>You play a key role in the development of the SIXT apps in a highly motivated mobile-team</li> <li>You have high standards in regards to quality which is reflected in your clean and testable code, solid architecture and your experience with code-reviews</li> <li>You work in an Agile setup (SCRUM) with product, design and backend experts in a proactive and fast-paced environment with flat hierarchies</li> <li>You constantly evaluate new technologies and apply them effectively to our products</li> <li>You communicate fluently in English and appreciate working in a culturally diverse team</li> <br/><br/></ul><strong><u>Come As You Are<br/></u></strong><ul> <li>You have plenty of experience in Java and are already up to speed with Kotlin</li> <li>You are proficient with cloud based API communication, Room Persistence storage, Material Design principles and Analytics</li> <li>You are familiar with Dependency Injection, Modularization, Continuous Integration, Retrofit, Eventbus, Espresso, JUnit, Proguard, Firebase or Crashlytics</li> <li>You enjoy exploring Play Services, Android Jetpack, Architecture Components, Instant Apps and Coroutines</li> <li>Optionally you are also experienced in connecting Android apps with Bluetooth, IoT, UART serial ports and Connected-Car systems and would like to lead the development of our internal telematic services/apps</li> <br/><br/></ul><strong><u>Feel Good<br/><br/></u></strong>In addition to the obligatory table football, driving simulators, and ping-pong table, our two dedicated Feel Good Managers focus on the wellbeing of our SIXT Tech colleagues. Amongst other things they will support you with your relocation, finding accommodation, visa issues and help you to organize team events, Meetups, and Townhalls. Our offices have different sizes, you will definitely find something according to your preferences. We follow no dress code. As a member of the SIXT-Family, you get attractive car rental and leasing offers as well as access to our large employee benefit portal where you find attractive offers for traveling, shopping and more. During breakfast, lunch, and dinner our high-quality restaurant offers daily changing meat, fish and vegetarian dishes, as well as a salad bar and freshly-baked pizza. Our coffee lounge for meeting and relaxing is opened the whole day. COME AS YOU ARE and DO WHAT YOU LOVE: Join our 300 IT colleagues and apply now (in English or German preferred)!</div>"}, {"id": 11213781, "source": "linkedin", "position": "Lead Data Engineering - Based in Berlin", "company": "Deep Blue Recruitment", "city": "Amsterdam", "country": ["Netherlands"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["agile", "analytics", "api", "continuous-integration", "data", "design", "git", "integration", "lead", "leader", "machine-learning", "microservices", "product", "python", "scala", "scale", "scrum", "tdd"], "category": "Data-Science", "epoch": 1569465844, "url": "https://nl.linkedin.com/jobs/view/lead-data-engineering-based-in-berlin-at-deep-blue-recruitment-1525830364?refId=904c5749-4e5f-4e30-877b-dd6c81183c22&position=3&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">Ever considered a move to the German capital Berlin?<br/><br/>Deep Blue Recruitment are currently working with one of the most successful FinTech companies in Europe that are looking for a Lead of Data Engineering to join their team in Berlin.<br/><br/>You will be an integral part of the team and will have a significant impact on the future direction of the business.<br/><br/>These will be your tasks<br/><ul><li> Own our event pipeline and data lake </li><li> Own the team’s technical strategy in close collaboration with Product and Data analytics </li><li> Work with the Data Engineering team to develop and improve our Data and Analytics platform </li><li> Develop and deliver high-impact, forward looking, engineering roadmaps for the team </li><li> Develop initiatives on ensuring data quality, accuracy, and reliability across the whole data organization </li><li> Implement and maintain APIs and microservices to integrate heterogeneous data sources into our Data pipeline </li><li> Design and implement continuous integration and deployment processes </li><li> Liaise with Product teams in productionizing machine learning code <br/><br/></li></ul><strong><u>Requirements<br/></u></strong><ul><li>7+ years experience in a similar engineering portfolio </li><li>3+ years experience in leading engineering teams </li><li> Solid understanding of handling event driven pipelines at scale </li><li> Strong experience in Python development </li><li> Experience with Scrum and agile development processes and methodologies </li><li> You work with Git, Continuous Integration, and TDD </li><li> You understand what it takes to build and support highly scalable and reliable Big Data platforms </li><li> University degree in Computer Science or a related technical field </li><li> Strong communication and written skills <br/><br/></li></ul><strong><u>Benefits<br/></u></strong><ul><li> Get paid a competitive salary with stock options </li><li> Optional German language courses </li><li> Full support to grow and take leadership from day one </li><li> Work in a beautiful office building located on the riverfront </li><li> You have the option to take your dog to work!</li><li> Relocation and visa support if needed <br/></li></ul>This is a permanent position and we are looking for someone to start immediately - apply today!</div>"}, {"id": 11059483, "source": "linkedin", "position": "Head of Data Science and Insights - Role based in Berlin at Deep Blue Recruitment", "company": "JOIN Solutions AG", "city": "Vancouver", "country": ["Canada"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["algorithm", "analytics", "data", "data-science", "design", "erp", "finance", "go", "ida", "lead", "leader", "next", "product", "system", "testing"], "category": "Data-Science", "epoch": 1569465849, "url": "https://ca.linkedin.com/jobs/view/head-of-data-science-and-insights-role-based-in-berlin-at-deep-blue-recruitment-at-join-solutions-ag-1468058992?refId=6d1e77d9-8b3e-4c05-a264-3b562b8b8523&position=1&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">Deep Blue Recruitment are currently working with one of the most successful FinTech companies in Europe that are looking for a Head of Data Science and Insights to join their team in Berlin.<br/><br/>You will be a key part of their leadership team and will have a significant impact on the future direction of the business and the way in which they harness data.<br/><br/><strong>These will be your tasks<br/></strong><ul> <li>You lead and develop your team to validate, interpret, and provide insights in dashboards, reports, and presentations for all departments as well as the management team.</li> <li>You use data and information visualisation to actively address unanswered business issues and generate business insights that push the business forward.</li> <li>You provide data mining, pattern and root cause analyses to help business units understand areas of untapped opportunity and develop your team in this direction.</li> <li>You move their BI department to the next level and start to design technical solutions for decision systems and the development of modelling algorithms to be deployed to production.</li> <li>You build, manage, and develop a team of Data Analysts, and Data Scientists.</li> <li>You set a vision, establishing a data-driven culture, and fostering the use of data to inform and make key business decisions</li> <br/><br/></ul><strong><u>Requirements<br/></u></strong><ul> <li>You have 5+ years of experience leading a data and analytics practice, delivering reporting, insights, and optimisation across a wide variety of businesses.</li> <li>You have played a strategic role collecting, managing and analysing data for different functions incl. marketing, product, operations, and finance. </li> <li>You have a passion for research and data and are highly skilled in performing quantitative analyses related to business and department performance.</li> <li>You are passionate about the inner workings of data technologies, have an understanding of A/B testing as well as vast knowledge in the identification of metrics that drive the long-term health of the business.</li> <li>You understand analytics methodologies and emerging trends, including knowing the best tools to deliver the insights required. You work to innovate our delivery experiences by staying ahead of the curve in delivery offerings and solutions.</li> <br/><br/></ul><strong><u>Benefits<br/></u></strong><ul> <li>Get paid a competitive salary with stock options </li> <li>Optional German language courses</li> <li>Full support to grow and take leadership from day one </li> <li>Work in a beautiful office building located on the riverfront </li> <li>You have the option to take your dog to work! </li> <li>Relocation and visa support if needed</li> <br/></ul>This is a permanent position and we are looking for someone to start immediately - apply today!</div>"}]}