{"listings": [{"id": 11871593, "source": "linkedin", "position": "Enterprise Risk Analyst", "company": "CoBank", "city": "Denver  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["associate", "full-time", "finance", "sales", "banking"], "category": "Finance", "epoch": 1570021925, "url": "https://www.linkedin.com/jobs/view/enterprise-risk-analyst-at-cobank-1535260555?refId=6aeeca5b-3711-44f3-9144-2a874a5ad46a&position=1&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">At CoBank and in the Enterprise Risk Management (ERM) team, the Enterprise Risk Analyst will be responsible for maintaining key components of the ERM program, performs data analysis and performance benchmarking in support of ongoing initiatives.<br/><br/>This is an exciting and challenging opportunity to be an integral part of a team with high visibility and responsibility in the organization. We are seeking a self-motivated, highly-driven team player with great ability to multitask and manage major cross-organizational projects and efforts that are part of the ERM program.<br/><br/><strong><u>Basic Qualifications<br/></u></strong><ul> <li> Bachelor’s degree in finance, economics, math, computer science or statistics </li> <li> 2 to 4 years of finance and risk management experience; or appropriate combination of education and experience. </li> <br/><br/></ul><strong><u>Preferred Qualifications<br/></u></strong><ul> <li> Master’s degree in a quantitative discipline preferred. </li> <li> Knowledge of the finance and lending industry including financial and risk modeling practices and concepts, financial instruments, and financial markets. </li> <li> Experience with market risk analyses principles such as interest rate risk, liquidity risk, funding risk, and currency risk. </li> <li> Experience with statistical software packages such as SAS, MATLAB, or R. Demonstrated expertise in problem solving. </li> <li> Experience in data mining and understanding of relational databases. </li> <li> Proficiency in Microsoft Office applications, including Excel and PowerPoint. </li> <li> Knowledge and/or experience with market risk modeling, prepayment modeling, loss forecasting, regression models and economic capital. </li> <li> Knowledge of financial, mathematical modeling theory and practice </li> <li> Knowledge of vendor tools such as QRM, Moody’s Risk Frontier, Polypaths. </li> <li> Excellent communication (both verbal and written) skills. Good listening and interpersonal skills. </li> <li> Demonstrated initiative and motivation, with the ability to work independently and in a team environment. </li> <li> FRM, PRM, and/or CFA certification. </li> <li> Knowledge of the current regulatory framework on risk modeling. Knowledge of agriculture industry. </li> <br/><br/></ul><strong><u>About CoBank<br/><br/></u></strong>CoBank stands strong as a $125 billion enterprise dedicated to the financial needs of rural communities. That means we help fund new ways to grow food, generate energy, access technology, and otherwise improve life in America. When you choose a career with us, you make a difference by standing for something that matters. A career at CoBank can offer you the opportunity to make a personal impact on the people and communities where we do business. We also provide competitive compensation, health and wellness benefits, company-funded retirement plan, matching 401(k), and professional development programs.<br/><br/>CoBank will not sponsor a work visa (e.g. H1B, etc.) to fill this position.<br/><br/>CoBank is an Equal Opportunity Employer.</div>"}, {"id": 11546845, "source": "linkedin", "position": "Operational Risk Analyst – Insurance Risk", "company": "CoBank", "city": "Denver  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["associate", "full-time", "finance", "sales", "banking"], "category": "Finance", "epoch": 1570021925, "url": "https://www.linkedin.com/jobs/view/operational-risk-analyst-%E2%80%93-insurance-risk-at-cobank-1535259608?refId=6aeeca5b-3711-44f3-9144-2a874a5ad46a&position=2&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">At CoBank, the Operational Risk Analyst is responsible for maintaining key components of the Risk Management framework including the bank’s insurance risk management program, select Third Party Risk Management program activities and will participate in other key initiatives and ad-hoc analyses.<br/><br/><strong><u>Essential Job Duties<br/></u></strong><ul> <li> Manages the bank’s insurance risk program and program documentation including insurance policies and procedures </li> <li> Manages the annual insurance renewal and budget process and invoicing process for accurate and timely payment </li> <li> Collects, tracks, and analyzes insurance risk data including claims and loss data </li> <li> Monitors, analyzes, and conducts research on premium, rate, and coverage changes to CoBank’s portfolio of insurance coverages </li> <li> Recommends, develops, and implements insurance risk management initiatives </li> <li> Conduct research and due diligence of the claims process where needed. </li> <li> Implements ongoing improvement practices, optimizes insurance processes </li> <li> Supports the Operational Risk team with select Third Party Risk Management program activities including reviewing and evaluating new and existing third party risk assessments </li> <li> Other duties as assigned. </li> <br/><br/></ul><strong><u>Basic Qualifications<br/></u></strong><ul> <li> Bachelor’s degree in finance, business, data science or information technology </li> <li> 2 to 4 years of finance and risk management experience; preferably in operational risk and/or insurance risk management. </li> <br/><br/></ul><strong><u>Preferred Qualifications<br/></u></strong><ul> <li> Knowledge of property and casualty insurance and related programs and familiarity with the finance and lending industry. </li> <li> Demonstrates understanding of insurance contracts and language, underwriting procedures, and/or claims adjusting procedures </li> <li> Demonstrated expertise in problem solving. </li> <li> Knowledge of statistics, data collection, analysis, and data presentation. </li> <li> Proficiency in Microsoft Office applications, including Excel, PowerPoint, Access and SharePoint. </li> <li> Excellent communication (both verbal and written) skills. Good listening and interpersonal skills. </li> <li> Demonstrated initiative and motivation, with the ability to work independently and in a team environment. </li> <br/></ul>CoBank stands strong as a $135 billion enterprise dedicated to the financial needs of rural communities. That means we help fund new ways to grow food, generate energy, access technology, and otherwise improve life in America. When you choose a career with us, you make a difference by standing for something that matters. A career at CoBank can offer you the opportunity to make a personal impact on the people and communities where we do business. We also provide competitive compensation, health and wellness benefits, company-funded retirement plan, matching 401(k), and professional development programs.<br/><br/>CoBank will not sponsor a work visa (e.g. H1B, etc.) to fill this position.<br/><br/>CoBank is an Equal Opportunity Employer.</div>"}, {"id": 11864756, "source": "linkedin", "position": "Senior Communications Associate", "company": "The George Washington University", "city": "Washington  D.C.", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["associate", "full-time", "public-relations", "art/creative", "writing/editing", "higher-education", "research"], "category": "Public Relations", "epoch": 1569985926, "url": "https://www.linkedin.com/jobs/view/senior-communications-associate-at-the-george-washington-university-1534199339?refId=6aeeca5b-3711-44f3-9144-2a874a5ad46a&position=3&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong>Posting Details<br/><br/></strong><strong><u>I. Job Overview<br/><br/></u></strong><strong>Job Description Summary:<br/><br/></strong>The Division of Development and Alumni Relations ( DAR ) is seeking a Senior Communications Associate. The Division of Development and Alumni Relations ( DAR ) is responsible for leading the university’s fundraising and engagement efforts. DAR seeks to promote a culture of philanthropy throughout the university community, including alumni, students, parents, faculty, staff, friends, corporations and foundations, patients and other constituents. Our goal is to advance GW’s mission of excellence in education, research, scholarship, and patient care. We connect the passions of our alumni and supporters with the aspirations of our students and faculty to provide the resources that ensure GW is positioned for preeminance as a global comprehensive research university.<br/><br/>DAR embraces the university’s core values – Integrity, Collaboration, Respect, Excellence, Openness, Diversity, Courage – that guide our work and our relationships. We embody these values to drive toward our common purpose – Only at GW, we change the world, one life at a time.<br/><br/>The Senior Communications Associate provides marketing and communications services that support the division’s fundraisers and central staff and advance fundraising, donor stewardship, and constituent engagement. The Senior Communications Associate will work with a portfolio of partners in schools and central units to recommend and develop messaging, collateral, outreach strategies, and tools that will articulate, promote, and generate support for their respective philanthropic priorities. This may include concepts, proposals, stewardship reports, and multimedia presentations, as well as program collateral and campaign materials. The Senior Communications Associate also works closely with the donor relations and events teams to manage marketing, communications, and programmatic aspects of donor stewardship and development events. S/he will develop strong relationships with partners across DAR and the university to source content for use in DAR outreach, stewardship, donor proposals, and other communications.<br/><br/>This senior position is typically responsible for all communication and marketing for a moderate to large or complex unit. This role works with leadership and other constituents to communicate and market the unit’s initiatives, programs, accomplishments and goals in order to raise profile and awareness of the unit among the community, both internally and externally. Typically this role will participate in the development and execution of the strategic communication and marketing plan for the unit, will execute the marketing and outreach for programs and events, will ensure consistent communication with GW’s desired image, brand and positioning throughout all communications, and is responsible for the development, maintenance, updating, and writing of the website, newsletter, publications, social media, and other materials. This role serves as liaison with media relations, and coordinates with the university on communications activities to ensure a consistent and efficient approach to events, initiatives, outreach and communication.<br/><br/><strong><u>Additional Responsibilities<br/></u></strong><ul><li>Partners with fundraisers across the university to develop marketing and communications strategies to support their prospecting, engagement, solicitation, and stewardship efforts. Develops, produces, and disseminates messaging, materials, and tools that further the division’s engagement and fundraising goals.</li><li>Manages production of select donor proposals and develops templates and tools to enhance efficiency and message and brand consistency in major gift proposals. Partners with faculty and administrators to understand donor motivations and build a case for support that is compelling for the donor and aligns with school / unit / department priorities. Liaises with designers, developers, and multimedia producers to identify and capture visual content, write and edit narrative, and produce compelling materials that draw attention and inspire action. Works with colleagues to build and maintain a fundraising-centric content inventory for each school / unit / central initiative, including standard language about fundraising priorities, stories and facts about the impact of philanthropy, and relevant visuals / multimedia.</li><li>Oversees marketing communications for select donor relations initiatives, stewardship materials, and development events. Crafts compelling messages, communications, and deliverables to appropriately thank donors and demonstrate their impact. Liaises with donor relations, fundraising, digital, and events staff to ensure an integrated constituent experience at development events and in donor stewardship activities.</li><li>Understands and effectively communicates the team’s capabilities and processes to project partners. Builds and shares project timelines, budgets, and creative briefs. Maintains relationships with external vendors and freelancers to support production as necessary.</li><li>Develops strong relationships with partners across DAR and the university – in particular with Division of External Relations and other communications professionals – to coordinate on development of school-specific materials. Through these relationships, ensure consistency and integration in messaging and maximize exposure for philanthropy content through all channels. Partners with colleagues to explore new mediums and methods to engage target audiences and to increase efficiency.</li><li>Performs other work related duties as assigned. The omission of specific duties does not preclude the supervisor from assigning duties that are logically related to the position.<br/></li></ul><strong><u>Minimum Qualifications<br/><br/></u></strong>Qualified candidates will hold a Bachelor’s degree in an appropriate area of specialization plus 2 years of relevant professional experience, or, a Master’s degree or higher in a relevant area of study. Degree must be conferred by the start date of the position. Degree requirements may be substituted with an equivalent combination of education, training and experience.<br/><br/><strong><u>Preferred Qualifications<br/><br/></u></strong><strong>Additional Required Licenses/Certifications/Posting Specific Minimum Qualifications:<br/><br/></strong><strong>Typical Hiring Range</strong> $58430 - $80355 How is pay for new employees determined at GW?<br/><br/>II. JOB DETAILS<br/><strong>Campus Location: </strong> Foggy Bottom, Washington, D.C.<br/><br/><strong>College/School/Department: </strong> Development &amp; Alumni Relations<br/><br/><strong>Family</strong> Comm, Mktg &amp; Media<br/><br/><strong>Sub-Family</strong> Communications and Public Relations<br/><br/><strong>Stream</strong> Individual Contributor<br/><br/><strong>Level</strong> Level 2<br/><br/><strong>Full-Time/Part-Time:</strong> Full-Time<br/><br/><strong>Hours Per Week:</strong> 40 hours<br/><br/><strong>Work Schedule:</strong> Monday-Friday, daytime hours<br/><br/><strong>Position Designation:</strong> Essential: Employees who perform functions that have been deemed essential to maintaining business or academic operations. Employees are generally expected to work from home during an event and may be asked to physically report to work.<br/><br/><strong>Telework:</strong> No<br/><br/><strong>Required Background Check:</strong> Criminal History Screening, Education/Degree/Certifications Verification, Social Security Number Trace, and Sex Offender Registry Search<br/><br/><strong><u>Special Instructions To Applicants<br/><br/></u></strong>Employer will not sponsor for employment Visa status<br/><br/><strong>Internal Applicants Only? </strong> No<br/><br/><strong>Posting Number:</strong> S008680<br/><br/><strong>Job Open Date:</strong> 09/30/2019<br/><br/><strong><u>Job Close Date<br/><br/></u></strong><strong>If temporary, grant funded or limited term appointment, position funded until:<br/><br/></strong><strong>Background Screening</strong> Successful Completion of a Background Screening will be required as a condition of hire.<br/><br/><strong><u>EEO Statement<br/><br/></u></strong>The university is an Equal Employment Opportunity/Affirmative Action employer that does not unlawfully discriminate in any of its programs or activities on the basis of race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or expression, or on any other basis prohibited by applicable law.</div>"}, {"id": 11054904, "source": "linkedin", "position": "New Graduate Development Program (Undergraduate) - Business Associate (Application Deadline - October 10th)", "company": "Visa", "city": "Foster City  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["full-time", "sales", "business-development", "consumer-services", "financial-services", "information-technology-and-services"], "category": "Sales", "epoch": 1551917526, "url": "https://www.linkedin.com/jobs/view/new-graduate-development-program-undergraduate-business-associate-application-deadline-october-10th-at-visa-1421295001?refId=6aeeca5b-3711-44f3-9144-2a874a5ad46a&position=4&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>The New Graduate Development Rotation Program (NGDP) is a two year program with four - six month rotations through Visa’s functions. The NGDP program supports Visa’s mission to build a strong entry level pipeline of talent with cross-functional knowledge and experience. Associates rotate through various parts of the business, including but not limited to: Digital Solutions, Marketing, Processing, Product, Sales and Strategy. In addition to meaningful rotations, Associates are given training &amp; development, mentoring, networking and leadership exposure.<br/><br/><strong><u>Sample Rotational Assignments Include<br/><br/></u></strong><strong><u><strong>Essential Functions<br/><br/></strong></u></strong>Visa’s Global <strong>Product </strong>Team is responsible for all aspects of product strategy and development in consumer and business products that drive revenue growth for Visa. The team develops new channel solutions and technology support, builds alliances and solutions for new products, and is responsible for product analytics. Products include Visa’s prepaid cards, Visa Signature, Verified by Visa, and others.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Develop marketing collateral, communication plan and client facing materials</li><li>Performing exploratory analysis and data mining on large datasets based on business hypothesis.</li><li>Performing ad hoc analysis, business Intelligence requests and data extractions.<br/></li></ul>Visa’s Global <strong>Marketing &amp; Communications </strong>Team conducts market research and analytics on consumers and clients to develop best-in-class marketing plans that accelerate Visa product adoption and growth. Additionally, this team is dedicated to increasing Visa brand equity through building trust with clients and investors and communicating corporate themes like Financial Inclusion and Corporate Social Responsibility, among other strategies.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Researching key merchants and their marketing strategies and summarizing the public data on those merchants.</li><li>Creating individualized merchant marketing strategies and recommendations.</li><li>Developing social engagement playbook and manage social engagements<br/></li></ul>Visa’s Global <strong>Merchant Sales &amp; Acquirers </strong>organization strives to be a trusted, strategic partner for the merchant community, delivering tangible value to increase revenue, increase efficiencies and grow business intelligence. The team is staffed to align with customers and business opportunities around the world.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Researching and analyzing industry to support Small and Medium Sized Businesses.</li><li>Project management for proposal efforts or major negotiations .</li><li>Assisting in developing a performance dashboard for products to present internally to client.<br/></li></ul>Visa’s Global <strong>Corporate Strategy </strong>Team is responsible for corporate strategy development and coordination, enterprise strategic projects and planning, strategic intelligence, and knowledge management. The team identifies, develops, and executes high-impact, complex global corporate initiatives that improve Visa’s growth and market position globally.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Collaborating with product and business lines across Regional and Functional areas to align on recommendations.</li><li>Conducting complex and detailed data analysis to assist in executive decision-making.</li><li>Supporting competitive pricing intelligence data gathering, analysis, and strategic response.<br/><br/></li></ul>Visa’s Global <strong>Audit and Risk </strong>Team works to ensure the safety, soundness and integrity of Visa and the payments ecosystem. They are responsible for identifying and mitigating threats to Visa while supporting the company’s growth and maintaining thought leadership on issues of importance to clients and governments everywhere. They work alongside business partners and clients to advise on risks, develop mitigations, maintain strong internal control and stay ahead of threats to the security of the payments ecosystem.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Conducting research and analysis of industry trends in the landscape to identify, prioritize and quantify key strategic trends.</li><li>Deepening knowledge of strategies, capabilities, and solutions of the Global Risk organization</li><li>Providing intelligence and technical analysis support to the Global Risk organization to further protect the payment ecosystem<br/></li></ul><strong><strong>Visa’s Business Solutions </strong></strong>team is responsible for all aspects of business strategy, development and management for Commercial products, platform, and information management. VBS products serve small business, middle market and large multinational companies, governments and commercial supply chain/B2B segments.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Researching and analysis on external and internal data to generate insights for the team to drive Commercial and Small Business partnerships and associated decisions Develop short-term, intermediate, and long-term strategy framework that articulates why risk management at Visa is a key differentiator in the market.</li><li>Developing client materials, Visa PR marketing materials, Account Executive training, and product value proposition. </li></ul><strong>Qualifications<br/></strong><ul><li><strong><u><strong>Basic Qualifications</strong></u></strong></li><li>Currently finishing a Bachelor’s degree program</li><li>Graduate between December 2019 - June 2020</li><li><u><strong>Preferred Qualifications</strong></u></li></ul><ul><li>All majors are welcome to apply</li><li>Exceptional academic achievement</li><li>Excellent analytical abilities, intellectually curiosity and interest in finding new ways to do things</li><li>Outstanding verbal and written communication skills</li><li>Professional maturity, strong work ethic and the ability to be flexible and adaptable to changing business needs</li><li>Demonstrated leadership capabilities in professional, academic, or volunteer environments</li><li>A global mindset and ability to work in a diverse workplace<br/><br/></li></ul><strong><u>Additional Information<br/><br/></u></strong>Application deadline is October 10, 2019. If the on-campus interview falls after this date, the advertised deadline on your campus will take precedence over the program application deadline.<br/><br/>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/><ul><li><strong><u>Physical Requirements<br/><br/></u></strong>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.</li><li><strong>Work Hours:<br/><br/></strong>This position requires the incumbent to be available during core business hours.<br/><br/><strong><u>Travel Requirements<br/><br/></u></strong>This position requires the incumbent to travel for work less than 10% of the time.<br/><br/></li></ul>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/><br/><strong><u>Exemption Status<br/><br/></u></strong>Non-Exempt<br/><br/>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/><br/>Job Number: REF21177I</div>"}, {"id": 11867784, "source": "linkedin", "position": "Executive Administrator & Project Coordinator, Global Brand Sponsorship and Innovation Marketing", "company": "Visa", "city": "San Francisco  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["full-time", "project-management", "information-technology", "consumer-services", "financial-services", "information-technology-and-services"], "category": "Project Management", "epoch": 1568851927, "url": "https://www.linkedin.com/jobs/view/executive-administrator-project-coordinator-global-brand-sponsorship-and-innovation-marketing-at-visa-1486206418?refId=6aeeca5b-3711-44f3-9144-2a874a5ad46a&position=5&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world&amp;aposs leader in digital payments technology, Visa&amp;aposs mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company&amp;aposs dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You&amp;aposre</strong> an Individual. <strong>We&amp;aposre</strong> the team for you. <strong>Together</strong>, let&amp;aposs transform the way the world pays<br/><br/><strong><u>Job Description<br/><br/></u></strong>Visa is searching for an experienced <strong><em>Executive Administrator</em></strong> to provide on-site support to the Chief Brand and Innovation officer who oversees a geographically dispersed marketing team. This is an exciting position for an experienced administrative and planning professional, looking to develop their capabilities, working in a dynamic, fast-paced environment, within a global company. The role is accountable for the smooth operations of the SVP and the Global Brand team and works closely with a broad group of global contacts, both internal and external to Visa.<br/><br/>The Executive Administrator needs to demonstrate a high client orientation, executive presence, and effective communication. This role requires a proactive self-starter who can work independently and anticipate client needs and will work on both admin work as well as special projects.<br/><br/><strong><u>Qualifications<br/><br/></u></strong><strong><u>Basic<br/></u></strong><ul><li>Bachelor&amp;aposs Degree or 2-3 years of work experience in fast moving environment. <br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>Bachelor&amp;aposs degree or 2-5 or more years working as an Executive Administrator or Executive Assistant, plus project management experience in a fast moving global environment</li><li>You are a team player with a positive, can-do attitude and you are passionate about your work and going the extra mile </li><li>You are highly organized with strong multi-tasking skills </li><li>You demonstrate excellent communication skills including exceptional judgment and discretion regarding information, which may be confidential, material and/or non-public </li><li>You have strong attention to detail </li><li>You have strong proficiency in Microsoft Office </li><li>Able to manage multiple projects effectively </li><li>Manage and track expenses</li></ul><strong>Additional Information<br/><br/></strong><u><strong>Executive Administration Responsibilities<br/></strong></u><ul><li>Provide executive level administrative support, including managing multiple executive calendars in parallel, booking and managing executive travel plans, expense reports using Visa tools for expense and purchase management and preparing for meetings for Chief Brand and Innovation Marketing Officer. </li><li>Establish and maintain effective and cooperative professional relationships with internal and external business partners, including several levels of management, Visa employees and Visa clients.</li><li>Plan onsite and offsite team meetings and events, including coordinating conference room set-up, catering, A/V, and logistical arrangements, and providing occasional on-location support for team activities such as group meetings and team outings.</li><li>Support executive communication of Chief Brand and Innovation Marketing Officer to team and stakeholders and support weekly direct reports meetings, with agenda management and notes.</li><li>Provide support for reports, projects and initiatives as requested.</li><li>Assist with team travel arrangements as requested.</li><li>Assist with space management, workspace move requests and submit facilities work orders.</li><li>Be responsive to reasonable requests for off-hours work, email and messages follow-up.<br/><br/></li></ul><strong>Project Coordinator <br/></strong><ul><li>Visa Everywhere Shop: provide support to Everywhere Shop lead, for merchandise selection, budget, annual planning, quarterly refreshes for the onsite store, twice annual in person sales and all future events and renovations. </li><li>Onboarding: Provide support as needed for all new team members, helping as needed with recruiting, interviewing, creating onboarding documents, and post-hire support. Assist with onboarding new Global M&amp;C employees including set up of workstation, technology and onboarding checklist.</li><li>Project Management: Manage our internal mentorship program, including twice annual matching cycles, quarterly communications and a yearly event, and provide project management/coordination support as needed on projects for the Strategy &amp; Planning team. </li><li>Document Maintenance: Support requirements for functional documentation, record keeping, and other needs to support Audit and Compliance requirements. </li><li>Travel Budget tracking: Lead process for S&amp;P team to collect travel requests, run monthly reports and manage the team travel budget. </li><li>Organization Chart Updates: Lead process for team to ensure org charts are updated monthly</li><li>Events Support: Participate in the planning and execution of quarterly all-staff meetings and employee engagement events, including coordinating all logistics.<br/></li></ul><u><strong>Physical Requirements<br/><br/></strong></u>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment (phones and computers), reach with hands and arms, and bend or lift up to 25 pounds.<br/><br/><u><strong>Travel Requirements<br/><br/></strong></u>The incumbent may be required to travel 0-10%.<br/><br/><em>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law. <br/><br/></em>Job Number: REF21792P</div>"}]}