{"listings": [{"id": 55497231, "source": "linkedin", "position": "Private Equity Analyst, TriArtisan Capital Advisors at Cowen", "company": "OneWire", "city": "New York City  NY", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Associate", "Full-time", "Finance", "Sales", "Financial Services", "Investment Banking"], "category": "Finance", "epoch": 1569300327, "url": "https://www.linkedin.com/jobs/view/private-equity-analyst-triartisan-capital-advisors-at-cowen-at-onewire-1486220009?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=1&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">Cowen<br/><br/><strong><u>Description<br/><br/></u></strong>TriArtisan Capital Advisors is a leading management-friendly, growth-oriented private equity firm founded in 2002. TriArtisan makes private equity investments in market leading companies who can benefit from TriArtisan’s patient long term capital to take advantage of the growth opportunities available to them.<br/><br/><strong><u>On a Day-to-day Basis Our Analysts<br/><br/></u></strong>Our Analysts work closely with senior investment professionals, management teams, investors, financial partners and operating partners as the firm primarily undertakes principal transactions. Associates will be involved in activities including principal investments, leveraged buyouts, take-privates and portfolio company management.<br/><ul> <li>Create financial models</li> <li>Create and maintain industry-specific business development books</li> <li>Conduct industry- and company-specific research</li> <li>Interact with stakeholders including financial partners, senior investment professionals, investors and operating partners</li> <li>Assess the attractiveness of potential new investments by forming a view on the industry and company</li> <li>Develop underwriting cases for potential investments along with drafting investor materials</li> <li>Conduct detailed due diligence on investment opportunities</li> <li>Provide support for existing portfolio companies</li> <br/></ul>Our environment is collaborative, demanding, fast-paced and entrepreneurial. Our clients, financial partners, and operating partners are extraordinarily dynamic and our people have what it takes to excel. Candidates should possess a strong willingness to work long hours and the ability to work towards project-driven goals.<br/><br/><strong><u>Requirements<br/><br/></u></strong><strong><em>1-2 years of prior Investment Banking or related experience.<br/><br/></em></strong><strong><em>Must have completed a formal Investment Banking training program. <br/></em></strong><ul> <li>Dedicated and motivated individuals possessing demonstrated academic achievement, strong quantitative skills, and finance and accounting background and coursework, as well as leadership, organizational, and teamwork skills.</li> <li>Ability to create innovative solutions, articulate complex ideas and adapt to a rapidly changing environment is essential.</li> <li>Must be able to work well under pressure and manage multiple projects.</li> <li>Candidates must have graduated from a four-year undergraduate college in <strong>May 2018 </strong>or earlier.</li> <li>Candidates are expected to have demonstrated a strong academic and professional record.</li> <li>Candidates must exhibit strong proficiency in Microsoft Excel, PowerPoint, and Word.</li> <br/></ul>As part of its hiring process, TriArtisan verifies identity and eligibility to work in the United States as required by law. At this time, TriArtisan will not sponsor a new applicant for an employment visa for this position.<br/><br/>Posted 09/14/2019<br/><ul> <li> Full Time position </li> <li> Compensation will be Market Rate</li></ul></div>"}, {"id": 55940382, "source": "linkedin", "position": "Private Equity Analyst, TriArtisan Capital Advisors", "company": "TriArtisan Capital Advisors", "city": "New York", "country": ["New York"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Entry level", "Full-time", "Finance", "Venture Capital & Private Equity"], "category": "Finance", "epoch": 1568695528, "url": "https://www.linkedin.com/jobs/view/private-equity-analyst-triartisan-capital-advisors-at-triartisan-capital-advisors-1459940511?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=2&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><p>TriArtisan Capital Advisors is a leading management-friendly, growth-oriented private equity firm founded in 2002. TriArtisan makes private equity investments in market leading companies who can benefit from TriArtisan’s patient long term capital to take advantage of the growth opportunities available to them.</p><p> </p><p>Our Analysts work closely with senior investment professionals, management teams, investors, financial partners and operating partners as the firm primarily undertakes principal transactions. Analysts will be involved in activities including principal investments, leveraged buyouts, take-privates and portfolio company management. On a day-to-day basis our analysts :</p><p><br/></p><ul><li>Create financial models</li><li>Create and maintain industry-specific business development books</li><li>Conduct industry- and company-specific research</li><li>Interact with stakeholders including financial partners, senior investment professionals, investors and operating partners</li><li>Assess the attractiveness of potential new investments by forming a view on the industry and company</li><li>Develop underwriting cases for potential investments along with drafting investor materials</li><li>Conduct detailed due diligence on investment opportunities</li><li>Provide support for existing portfolio companies</li></ul><p> </p><p>Our environment is collaborative, demanding, fast-paced and entrepreneurial. Our clients, financial partners, and operating partners are extraordinarily dynamic and our people have what it takes to excel. Candidates should possess a strong willingness to work long hours and the ability to work towards project-driven goals.</p><p> </p><p><strong>Requirements</strong>:</p><p> </p><p><strong><em>1-2 years of prior Investment Banking or related experience.</em></strong> </p><p><strong><em>Must have completed a formal Investment Banking training program. </em></strong> </p><p> </p><ul><li>Dedicated and motivated individuals possessing demonstrated academic achievement, strong quantitative skills, and finance and accounting background and coursework, as well as leadership, organizational, and teamwork skills.</li><li>Ability to create innovative solutions, articulate complex ideas and adapt to a rapidly changing environment is essential.</li><li>Must be able to work well under pressure and manage multiple projects.</li><li>Candidates must have graduated from a four-year undergraduate college in <strong>May 2018 </strong>or earlier.</li><li>Candidates are expected to have demonstrated a strong academic and professional record.</li><li>Candidates must exhibit strong proficiency in Microsoft Excel, PowerPoint, and Word.</li></ul><p> </p><p>As part of its hiring process, TriArtisan verifies identity and eligibility to work in the United States as required by law. At this time, TriArtisan will not sponsor a new applicant for an employment visa for this position.</p></div>"}, {"id": 55812470, "source": "linkedin", "position": "Sponsorship Coordinator", "company": "Live Nation Entertainment", "city": "Phoenix", "country": ["Arizona"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Entry level", "Full-time", "Sales", "Marketing", "Advertising", "Marketing and Advertising", "Entertainment", "Sports"], "category": "Sales", "epoch": 1566881128, "url": "https://www.linkedin.com/jobs/view/sponsorship-coordinator-at-live-nation-entertainment-1489576317?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=3&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><p>Title: Sponsorship Coordinator </p><p>Location: Phoenix, AZ </p><p><strong><br/></strong> </p><p><strong>Who are we?</strong> </p><p>Live Nation Entertainment is the world’s leading live entertainment company comprised of global market leaders: Ticketmaster, Live Nation Concerts, Live Nation Media &amp; Sponsorship and Artist Nation Management. Ticketmaster is the global event ticketing leader with nearly 500 million tickets sold and more than 12,500 clients worldwide. Live Nation Concerts is the largest provider of live entertainment in the world promoting more than 30,000 shows annually for nearly 4,000 artists in 40 countries. Artist Nation Management is one of the world’s leading artist management companies, representing more than 350 artists. These businesses power Live Nation Media &amp; Sponsorship to deliver music marketing programs across 1,000 brands enabling advertisers to tap into the over 90 million fans Live Nation Entertainment delivers annually through its live event and digital platforms. </p><p><strong><br/></strong> </p><p><strong>Who are you?</strong> </p><p>Passionate and motivated.  Driven, with an entrepreneurial spirit and leadership qualities.  Resourceful, innovative, forward thinking and committed. At Live Nation Entertainment, our people embrace these qualities, so if this sounds like you then please read on!  </p><p><strong><br/></strong> </p><p><strong>The Role:</strong> </p><p>Live Nation Entertainment’s Media &amp; Sponsorship Division is seeking <strong>a Sponsorship Coordinator.  </strong>This position will serve as the local anchor for the Venue Network Sales team in the location above along with the Director of Sales and is responsible for the fulfillment of local and national sponsorships by ensuring the delivery of contractual elements and providing excellent customer service to clients, while collaborating with internal team members. </p><p><br/> </p><p>Live Nation Media &amp; Sponsorship architects, sells and manages the company’s national corporate sponsorship programs with the world’s most recognizable brands. It is an exciting, fast-paced team that collaborates with all facets of Live Nation’s business including venues, festivals, ticketing, artists, content, media (digital, social, mobile), promotions, and concert production. To learn more about our division, check out: https://livenationforbrands.com/. </p><p><strong><br/></strong> </p><p><strong>Responsibilities:</strong> </p><ul><li>Provide sales support to Director of Sales and aid in the sales pipeline by conducting market and brand research, prospecting, brainstorming inventory ideas and concepts, cold calling, etc. </li><li>Develop sales presentations and proposals for prospective clients with Director of Sales guidance. </li><li>Facilitate amphitheater, club, and theatre sponsorship asset requirements with applicable departments and divisions. </li><li>Oversee legal contract process, approvals, financial documents and budget management for local sponsors.   </li><li>Serve as a liaison between internal departments to ensure contractual fulfillment, proper project management pace, and the path to fulfillment. </li><li>Manage sponsor ticketing needs including order placement, tracking status, and client delivery. </li><li>Supervise coordination and execution of sponsorship activations during concerts including but not limited to brand displays, interactive consumer destinations, product sampling, signage, out-of-home advertising, hospitality events, promotions, social engagement, etc. </li><li>Assemble local recap presentations and provide supporting content for national recap composition. </li><li>Maintain program tracking tools and accurate information to manage sponsor business including budgets, AP/AR, inventory reports, amenity implementation, ticketing, CRM system, etc. </li><li>Manage local sponsorship interns using intern curriculum guidelines. </li></ul><p><strong><br/></strong> </p><p><strong>Qualifications:</strong> </p><ul><li>Bachelor's degree required plus a minimum 2 years relative business experience in sales, business development or client service. </li><li>Understanding of how sponsor specific goals factor into sponsorship business solutions, strategy, inventory selection, and package building process. </li><li>Strong multi-tasking and organizational skills with ability to keep detailed records. </li><li>Goal oriented and driven to achieve above average results. </li><li>Top notch customer service skills with commitment to excellence. </li><li>Stronger verbal and written communication skills. </li><li>Time management expert with a keen sense of daily task prioritization </li><li>Creative-thinking approach to customer success and internal operations. </li><li>Strong ability to problem-solve and think quickly to achieve resolution. </li><li>Computer proficiency:  Word, Excel, and PowerPoint required; Salesforce and social media desirable. </li><li>Willing to work shows during nights and weekends. </li><li>Reliable transportation to get to and from office and concert venue(s). </li><li>Ability to lift heavy boxes as required. </li></ul><p><br/> </p><p>If the above description sounds like you and fits your background, apply online at www.livenationcareers.com to join the Live Nation Entertainment team today! </p><p><br/> </p><p>Applicants for employment in the U.S. must possess work authorization which does not require sponsorship by the employer for a visa. </p><p><strong><br/></strong> </p><p><strong>EQUAL EMPLOYMENT OPPORTUNITY</strong><br/>Live Nation Entertainment strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law. </p><p><strong><br/></strong> </p><p><strong>HIRING PRACTICES</strong><br/>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. </p><p><br/> </p><p>Live Nation Entertainment recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Live Nation Entertainment may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, Internet recruiting, job fairs, college recruiting and search firms.</p></div>"}, {"id": 55927595, "source": "linkedin", "position": "New Graduate Development Program (Undergraduate) - Business Associate (Application Deadline - October 10th)", "company": "Visa", "city": "Foster City  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Sales", "Business Development", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Sales", "epoch": 1551761129, "url": "https://www.linkedin.com/jobs/view/new-graduate-development-program-undergraduate-business-associate-application-deadline-october-10th-at-visa-1421295001?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=4&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>The New Graduate Development Rotation Program (NGDP) is a two year program with four - six month rotations through Visa’s functions. The NGDP program supports Visa’s mission to build a strong entry level pipeline of talent with cross-functional knowledge and experience. Associates rotate through various parts of the business, including but not limited to: Digital Solutions, Marketing, Processing, Product, Sales and Strategy. In addition to meaningful rotations, Associates are given training &amp; development, mentoring, networking and leadership exposure.<br/><br/><strong><u>Sample Rotational Assignments Include<br/><br/></u></strong><strong><u><strong>Essential Functions<br/><br/></strong></u></strong>Visa’s Global <strong>Product </strong>Team is responsible for all aspects of product strategy and development in consumer and business products that drive revenue growth for Visa. The team develops new channel solutions and technology support, builds alliances and solutions for new products, and is responsible for product analytics. Products include Visa’s prepaid cards, Visa Signature, Verified by Visa, and others.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Develop marketing collateral, communication plan and client facing materials</li><li>Performing exploratory analysis and data mining on large datasets based on business hypothesis.</li><li>Performing ad hoc analysis, business Intelligence requests and data extractions.<br/></li></ul>Visa’s Global <strong>Marketing &amp; Communications </strong>Team conducts market research and analytics on consumers and clients to develop best-in-class marketing plans that accelerate Visa product adoption and growth. Additionally, this team is dedicated to increasing Visa brand equity through building trust with clients and investors and communicating corporate themes like Financial Inclusion and Corporate Social Responsibility, among other strategies.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Researching key merchants and their marketing strategies and summarizing the public data on those merchants.</li><li>Creating individualized merchant marketing strategies and recommendations.</li><li>Developing social engagement playbook and manage social engagements<br/></li></ul>Visa’s Global <strong>Merchant Sales &amp; Acquirers </strong>organization strives to be a trusted, strategic partner for the merchant community, delivering tangible value to increase revenue, increase efficiencies and grow business intelligence. The team is staffed to align with customers and business opportunities around the world.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Researching and analyzing industry to support Small and Medium Sized Businesses.</li><li>Project management for proposal efforts or major negotiations .</li><li>Assisting in developing a performance dashboard for products to present internally to client.<br/></li></ul>Visa’s Global <strong>Corporate Strategy </strong>Team is responsible for corporate strategy development and coordination, enterprise strategic projects and planning, strategic intelligence, and knowledge management. The team identifies, develops, and executes high-impact, complex global corporate initiatives that improve Visa’s growth and market position globally.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Collaborating with product and business lines across Regional and Functional areas to align on recommendations.</li><li>Conducting complex and detailed data analysis to assist in executive decision-making.</li><li>Supporting competitive pricing intelligence data gathering, analysis, and strategic response.<br/><br/></li></ul>Visa’s Global <strong>Audit and Risk </strong>Team works to ensure the safety, soundness and integrity of Visa and the payments ecosystem. They are responsible for identifying and mitigating threats to Visa while supporting the company’s growth and maintaining thought leadership on issues of importance to clients and governments everywhere. They work alongside business partners and clients to advise on risks, develop mitigations, maintain strong internal control and stay ahead of threats to the security of the payments ecosystem.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Conducting research and analysis of industry trends in the landscape to identify, prioritize and quantify key strategic trends.</li><li>Deepening knowledge of strategies, capabilities, and solutions of the Global Risk organization</li><li>Providing intelligence and technical analysis support to the Global Risk organization to further protect the payment ecosystem<br/></li></ul><strong><strong>Visa’s Business Solutions </strong></strong>team is responsible for all aspects of business strategy, development and management for Commercial products, platform, and information management. VBS products serve small business, middle market and large multinational companies, governments and commercial supply chain/B2B segments.<br/><br/><strong><u>Responsibilities In a Rotation May Include<br/></u></strong><ul><li>Researching and analysis on external and internal data to generate insights for the team to drive Commercial and Small Business partnerships and associated decisions Develop short-term, intermediate, and long-term strategy framework that articulates why risk management at Visa is a key differentiator in the market.</li><li>Developing client materials, Visa PR marketing materials, Account Executive training, and product value proposition. </li></ul><strong>Qualifications<br/></strong><ul><li><strong><u><strong>Basic Qualifications</strong></u></strong></li><li>Currently finishing a Bachelor’s degree program</li><li>Graduate between December 2019 - June 2020</li><li><u><strong>Preferred Qualifications</strong></u></li></ul><ul><li>All majors are welcome to apply</li><li>Exceptional academic achievement</li><li>Excellent analytical abilities, intellectually curiosity and interest in finding new ways to do things</li><li>Outstanding verbal and written communication skills</li><li>Professional maturity, strong work ethic and the ability to be flexible and adaptable to changing business needs</li><li>Demonstrated leadership capabilities in professional, academic, or volunteer environments</li><li>A global mindset and ability to work in a diverse workplace<br/><br/></li></ul><strong><u>Additional Information<br/><br/></u></strong>Application deadline is October 10, 2019. If the on-campus interview falls after this date, the advertised deadline on your campus will take precedence over the program application deadline.<br/><br/>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/><ul><li><strong><u>Physical Requirements<br/><br/></u></strong>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.</li><li><strong>Work Hours:<br/><br/></strong>This position requires the incumbent to be available during core business hours.<br/><br/><strong><u>Travel Requirements<br/><br/></u></strong>This position requires the incumbent to travel for work less than 10% of the time.<br/><br/></li></ul>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/><br/><strong><u>Exemption Status<br/><br/></u></strong>Non-Exempt<br/><br/>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/><br/>Job Number: REF21177I</div>"}, {"id": 55019476, "source": "linkedin", "position": "Program Manager DPS Products", "company": "Visa", "city": "Highlands Ranch  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Project Management", "Information Technology", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Project Management", "epoch": 1515473130, "url": "https://www.linkedin.com/jobs/view/program-manager-dps-products-at-visa-1458282326?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=5&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>As a Program Manager at Visa, you will lead complex, multi-disciplinary programs for the DPS Program Management team. You will plan requirements with stakeholders and guide programs through the entire lifecycle considering all stakeholder inputs across different functions. This includes monitoring project schedules and working with stakeholders to ensure that multiple, simultaneous projects are working together to drive to the success of an entire program.<br/><br/>You will also be supporting project stakeholders in identifying risks and bottle necks, and using your influence to alleviate those roadblocks. You will be responsible for the execution and delivery through completion, for a program. Programs can often span office locations and time zones, and your responsibility will be to keep all stakeholders coordinated on the program’s status, milestones and deadlines.<br/><br/>The person filling this position will be responsible and accountable for coordinating activities and communicating status of projects related to new products, features and services that drive client satisfaction, differentiate the Visa DPS product offering, and drive Visa DPS Service revenues.<br/><ul><li><strong><u><strong>Essential Functions</strong></u></strong></li></ul><ul><li>Will plan, execute, and deliver projects through completion for a product or program</li><li>Independently manage a range of projects and initiatives, providing structure through the full lifecycle</li><li>Lead a cross functional team consisting of individual contributors and managers who are conceptualizing, rationalizing, and driving multiple simultaneous projects</li><li>Work with variety of stakeholders to manage scope, secure support and resources for execution, and deploy processes that improve day-to-day operations</li><li>Reconcile competing priorities, utilize synergies, align complementary initiatives, and build coalitions among cross-functional partners</li><li>Work through challenges, identify bottlenecks and dependencies, and unblock teams for execution</li><li>Work daily with cross functional teams to gather and communicate project status, progress, milestones, deliverables, outcomes, and lessons learned to all applicable parties</li><li>Understand and report project impact and fit on overall program development budget </li><li>Demonstrates Visa Leadership principles</li></ul><strong>Qualifications<br/><br/></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>4 years of work experience with a Bachelor’s Degree or at least 2 years of work experience with an Advanced degree (e.g. Masters, MBA, JD, MD) or 0 years of work experience with a PhD degree<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>7-10 years of work experience and a Bachelor’s Degree or 6 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD.</li><li>Strong product development skills with a sound understanding of payment technology, risk and fraud management, other ecosystem requirements</li><li>3+ years of experience in the payments industry (e.g. payment processing, acquiring, payment technology provider, payment brand etc.)</li><li>3+ years of experience in technical or business program/project management</li><li>Proficiency with linear software development life cycles and software development methodologies such as Agile (SAFe) and waterfall.</li><li>Excellent communications skills, both oral and written. Must be able to communicate effectively and confidently with users, team members and management.</li><li>Aptitude to collaborate with cross functional teams to build robust, reliable and scalable payment solutions</li><li>Aptitude for understanding, digesting and analyzing complex systems integration.</li><li>Strong facilitation skills. Must be able to elicit requirements from various personalities across organizational and geographical boundaries.</li><li>Must be flexible and willing to undertake a wide variety of challenging tasks.</li><li>Ability to work some flexible hours due to varying time zones across Visa’s regions.</li><li>Knowledge in issuer processing technology or solutions<br/><br/></li></ul><strong><u>Work Authorization<br/><br/></u></strong><strong>Additional Information<br/></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/></li></ul>Work Hours<br/><ul><li>Incumbent must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Travel<br/></u></strong><ul><li>Incumbent must be able to travel up to 25%<br/></li></ul>Physical Requirements<br/><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.<br/></li></ul>EEOC<br/><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF20577B</div>"}, {"id": 55846148, "source": "linkedin", "position": "Product Management Intern, DPS Risk Product & Analytics", "company": "Visa", "city": "Highlands Ranch  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Education", "Training", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Education", "epoch": 1479185131, "url": "https://www.linkedin.com/jobs/view/product-management-intern-dps-risk-product-analytics-at-visa-1522416664?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=6&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>The DPS Risk Services vision is to partner with our clients to provide future-ready risk products and services that enable them to achieve superior performance. As a DPS Product Management Intern at Visa, you will support the efforts of DPS Risk Service team and drive the latest and most innovative ideas through the product development lifecycle. You will assist in delivering next generation product offerings to our customers, to prevent fraud and improve customer experience.<br/><br/>You must be a self-starter, ready to learn and experiment, and be able to think both strategic and tactically. As part of this role, you will require to support the evaluation of product opportunities, collaborate with the team to help define product requirements, and work with development teams to help deliver enhancements to DPS&amp;aposs suite of fraud and risk products.<br/><ul><li>Collaborate with stakeholders to define business and technical requirements for existing and new fraud and risk products</li><li>Participate in requirements prioritization, while tracking and balancing time-to-market to deliver the optimal business impact</li><li>Contribute to the ongoing product roadmap and enhancement planning discussions</li><li>Provide support to the various customer support teams related to our suite of fraud and risk products.</li><li>Manage the department SharePoint site</li><li>Manage the refresh of product documentation, sales presentations, and other related marketing collateral.</li><li>Provide backup support to the Product Managers as needed</li><li>Manage small projects of minimal complexity<br/><br/><br/></li></ul><strong><u>Basic Qualifications<br/><br/></u></strong><strong>Qualifications<br/></strong><ul><li>Must have a High School diploma or equivalent</li><li>Pursuing a Bachelor or Master’s degree in Business, Computer Science, or related field Graduating December 2020 or later<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>1 or more years of work experience</li><li>The ability to take on challenges and address problems head-on</li><li>Strong work ethic; eager to contribute to the team’s success</li><li>Strong desire and aptitude to work hands-on with data and analytics</li><li>Excellent written and oral communication skills</li><li>Creative spark in working innovatively with long-established systems and processes</li><li>Team player who is able to work independently with general supervision</li><li>Strong ability to collaborate</li><li>Highly driven and resourceful</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Work Authorization<br/></u></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/></li></ul>Work Hours<br/><ul><li>Incumbent must make themselves available during core business hours.<br/></li></ul>Travel Requirements<br/><ul><li>This position requires the incumbent to travel for work less than 10% of the time.<br/></li></ul>Physical Requirements<br/><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms<br/></li></ul>EEOC<br/><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF22115D</div>"}, {"id": 55483259, "source": "linkedin", "position": "Program Manager - North America Business Planning & Operations", "company": "Visa", "city": "Foster City  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Project Management", "Information Technology", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Project Management", "epoch": 1515473131, "url": "https://www.linkedin.com/jobs/view/program-manager-north-america-business-planning-operations-at-visa-1465105857?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=7&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/>You’re an Individual. We’re the team for you. Together, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>The North America Business Planning and Operations (BPO) team is part of the North America Operations team, which works in support of the North America Sales organization. This position will involve working on key initiatives such as:<br/><ul><li><strong><strong>NA Business Planning:</strong></strong> lead and/or coordinate all aspects of NA business planning, e.g., develop NA and relevant segment scorecards, analyze and track performances, develop NA Operations annual operating plan and budget forecasting, align with key stakeholders, e.g., Global Business Planning &amp; Operations, NA Finance, NA Functional Leads, etc.</li><li><strong><strong>NA Operations:<br/></strong></strong><ul><li>Manage North America Charitable Giving, e.g., gather and verify charitable donation information, obtain NA President’s approval, provide charitable donation status, etc.</li><li>Support Business Operations Analytics, e.g., work with NA Business Operations and Cross Border teams on ad hoc analytics in support of NA business</li></ul></li><li><strong><strong>NA Controls:</strong></strong> partner with NA Risk, NA Compliance, and NA Controllership to continue to strengthen our controls, e.g., develop Controls scorecard, lead and/or coordinate Risk Champion implementation, lead and/or coordinate internal audit testing, provide non-compliance reports, etc.<br/></li></ul>This Manager position will work closely with and report to a Sr. Director, NA BPO on key initiatives/projects describe above and other ad hoc projects in support of North America business.<br/><br/>The ideal candidate is a strategic thinker with outstanding analytical, problem-solving, and communication skills, and very detail-oriented. This individual will be expected to have strong project management skills and over time, develop the ability to drive change and influence in cross-functional settings.<br/><br/><strong><u>Other Critical Attributes<br/></u></strong><ul><li>Bias toward action</li><li>Quickly grasping complex topics, problem solving and moving to execution</li><li>Ability to manage competing demands that involve rapid turnaround times and time-critical decisions</li><li>Strong quantitative analytical skills, including querying, organizing and interrogating Visa and external data and then summarizing insights<br/><br/></li></ul><strong><u>Responsibilities<br/></u></strong><ul><li>Support the development of scorecards for the North America business and ongoing production of scorecard updates every quarter</li><li>Support NA Operations annual operating budget development</li><li>Manage and/or coordinate NA Operations budget forecasting</li><li>Support NA Charitable Giving approval process, and liaise with Global Social Impact team to ensure timely charity organization vetting and payment processing</li><li>Identify process improvement opportunities and improve the processes, as applicable</li><li>Develop powerpoint presentations in support of the projects</li><li>Work cross-functionally with NA Business Operations and Cross Border teams on ad hoc analytics</li></ul><strong>Qualifications<br/><br/></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li> 4 years of work experience with a Bachelors degree or at least 2 years of work experience with an Advanced degree (e.g., Masters, MBA, JD, MD) <br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>7-10 years of work experience with a Bachelors degree or 6 years of work experience with an Advanced degree (e.g., Masters, MBA, JD, MD) in Finance, analytics, or related quantitative field</li><li>Prior Visa experience in an analytical role (i.e., have experience in accessing Visa Financial systems, VisaNet data, and other Visa analytical systems) and payments industry experience helpful</li><li>Outstanding problem solving skills, able to multi-task and manage competing priorities</li><li>Highly organized with strong project management skills and very detail-oriented</li><li>Strong written and verbal communication skills</li><li>Strong Microsoft product skills, in particular, Excel (including formulas) and PowerPoint skills</li><li>Experience with Tableau or similar data visualization tools, and financial systems (e.g., Hyperion, TM1, Oracle, etc.)</li><li>Intellectually curious about the payments industry</li><li>Ability to influence others, e.g., cross-functional stakeholders and leaders</li><li>Composure and clarity required to interact with cross-functional teams, senior management, and executives</li><li>Work with limited direction, usually within a complex and often ambiguous environment, to drive rigorous, fact-based insights, recommendations, and solutions</li><li>Passionate about making things better, e.g., improving processes, reducing inefficiencies, etc.</li><li>Team-oriented, collaborative, and diplomatic</li></ul><strong>Additional Information<br/></strong><strong>Work Authorization<br/></strong><ul><li>Authorization to work in the United States is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position<br/></li></ul><strong> <strong>Location<br/></strong></strong><ul><li>Relocation assistance will not be offered for this position<br/></li></ul><strong> <strong>Work Hours<br/></strong></strong><ul><li>Incumbent must make themselves available during core business hours<br/></li></ul><strong> <strong>Travel<br/></strong></strong><ul><li>This position requires the incumbent to travel up to 5% (minimal travel)<br/></li></ul><strong> <strong>Physical Requirements<br/></strong></strong><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms.<br/></li></ul>Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law<br/><br/>Job Number: REF21305H</div>"}, {"id": 55762322, "source": "linkedin", "position": "Executive Administrator & Project Coordinator, Global Brand Sponsorship and Innovation Marketing", "company": "Visa", "city": "San Francisco  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Project Management", "Information Technology", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Project Management", "epoch": 1533617132, "url": "https://www.linkedin.com/jobs/view/executive-administrator-project-coordinator-global-brand-sponsorship-and-innovation-marketing-at-visa-1486206418?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=8&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world&amp;aposs leader in digital payments technology, Visa&amp;aposs mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company&amp;aposs dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You&amp;aposre</strong> an Individual. <strong>We&amp;aposre</strong> the team for you. <strong>Together</strong>, let&amp;aposs transform the way the world pays<br/><br/><strong><u>Job Description<br/><br/></u></strong>Visa is searching for an experienced <strong><em>Executive Administrator</em></strong> to provide on-site support to the Chief Brand and Innovation officer who oversees a geographically dispersed marketing team. This is an exciting position for an experienced administrative and planning professional, looking to develop their capabilities, working in a dynamic, fast-paced environment, within a global company. The role is accountable for the smooth operations of the SVP and the Global Brand team and works closely with a broad group of global contacts, both internal and external to Visa.<br/><br/>The Executive Administrator needs to demonstrate a high client orientation, executive presence, and effective communication. This role requires a proactive self-starter who can work independently and anticipate client needs and will work on both admin work as well as special projects.<br/><br/><strong><u>Qualifications<br/><br/></u></strong><strong><u>Basic<br/></u></strong><ul><li>Bachelor&amp;aposs Degree or 2-3 years of work experience in fast moving environment. <br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>Bachelor&amp;aposs degree or 2-5 or more years working as an Executive Administrator or Executive Assistant, plus project management experience in a fast moving global environment</li><li>You are a team player with a positive, can-do attitude and you are passionate about your work and going the extra mile </li><li>You are highly organized with strong multi-tasking skills </li><li>You demonstrate excellent communication skills including exceptional judgment and discretion regarding information, which may be confidential, material and/or non-public </li><li>You have strong attention to detail </li><li>You have strong proficiency in Microsoft Office </li><li>Able to manage multiple projects effectively </li><li>Manage and track expenses</li></ul><strong>Additional Information<br/><br/></strong><u><strong>Executive Administration Responsibilities<br/></strong></u><ul><li>Provide executive level administrative support, including managing multiple executive calendars in parallel, booking and managing executive travel plans, expense reports using Visa tools for expense and purchase management and preparing for meetings for Chief Brand and Innovation Marketing Officer. </li><li>Establish and maintain effective and cooperative professional relationships with internal and external business partners, including several levels of management, Visa employees and Visa clients.</li><li>Plan onsite and offsite team meetings and events, including coordinating conference room set-up, catering, A/V, and logistical arrangements, and providing occasional on-location support for team activities such as group meetings and team outings.</li><li>Support executive communication of Chief Brand and Innovation Marketing Officer to team and stakeholders and support weekly direct reports meetings, with agenda management and notes.</li><li>Provide support for reports, projects and initiatives as requested.</li><li>Assist with team travel arrangements as requested.</li><li>Assist with space management, workspace move requests and submit facilities work orders.</li><li>Be responsive to reasonable requests for off-hours work, email and messages follow-up.<br/><br/></li></ul><strong>Project Coordinator <br/></strong><ul><li>Visa Everywhere Shop: provide support to Everywhere Shop lead, for merchandise selection, budget, annual planning, quarterly refreshes for the onsite store, twice annual in person sales and all future events and renovations. </li><li>Onboarding: Provide support as needed for all new team members, helping as needed with recruiting, interviewing, creating onboarding documents, and post-hire support. Assist with onboarding new Global M&amp;C employees including set up of workstation, technology and onboarding checklist.</li><li>Project Management: Manage our internal mentorship program, including twice annual matching cycles, quarterly communications and a yearly event, and provide project management/coordination support as needed on projects for the Strategy &amp; Planning team. </li><li>Document Maintenance: Support requirements for functional documentation, record keeping, and other needs to support Audit and Compliance requirements. </li><li>Travel Budget tracking: Lead process for S&amp;P team to collect travel requests, run monthly reports and manage the team travel budget. </li><li>Organization Chart Updates: Lead process for team to ensure org charts are updated monthly</li><li>Events Support: Participate in the planning and execution of quarterly all-staff meetings and employee engagement events, including coordinating all logistics.<br/></li></ul><u><strong>Physical Requirements<br/><br/></strong></u>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment (phones and computers), reach with hands and arms, and bend or lift up to 25 pounds.<br/><br/><u><strong>Travel Requirements<br/><br/></strong></u>The incumbent may be required to travel 0-10%.<br/><br/><em>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law. <br/><br/></em>Job Number: REF21792P</div>"}, {"id": 55521261, "source": "linkedin", "position": "Program Manager, North America Business Operations", "company": "Visa", "city": "San Francisco  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Sales", "Business Development", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Sales", "epoch": 1479185133, "url": "https://www.linkedin.com/jobs/view/program-manager-north-america-business-operations-at-visa-1522413035?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=9&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world&amp;aposs leader in digital payments technology, Visa&amp;aposs mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company&amp;aposs dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You&amp;aposre</strong> an Individual. <strong>We&amp;aposre</strong> the team for you. <strong>Together</strong>, let&amp;aposs transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>Visa’s North America Business Operations (BizOps) team is part of the North America Operations team, which works in support of the North America Sales organization. The four main areas of responsibilities for the team are i) special projects in support of the North America business ii) content and curation for key client-facing and internal events iii) sales intelligence and analytical reporting for our client-facing account teams iv) core business operations projects, e.g., dashboards, rules and waivers, audit, etc.<br/><br/>BizOps is hiring a Senior Manager, Business Operations. This individual will partner with the VP, Business Operations, the Head of North America Operations, and the broader North America Operations group to support the North America market across the four main areas described above.<br/><br/><strong><u>Other Critical Attributes<br/><br/></u></strong>The successful candidate will be a strategic thinker with strong analytical and problem-solving skills. This individual will have strong project management skills and the ability to drive change in cross-functional settings.<br/><ul><li>Bias toward action</li><li>Quickly grasping complex topics, problem solving, and moving to execution</li><li>Ability to manage competing demands that involve rapid turnaround times and time-critical decisions<br/><br/></li></ul><strong><u>Essential Functions<br/></u></strong><ul><li>Deliver on high-priority, strategic projects with data-backed recommendations in support of the North America leadership team</li><li>Lead the production of executive presentations, speeches, FAQs, etc. for various Visa events and executive client meetings</li><li>Develop strong understanding of the priorities of all functional teams (including Sales, Product, Marketing, Finance, HR, Consulting, etc.), working to share knowledge and drive the North America region towards aligned goals and targets</li><li>Define, manage and embed new BAU processes (e.g., information sharing, reporting dashboards, etc.) in support of the business</li><li>Manage project-related interactions and communications with functional leaders across the North America organization</li><li>Analyze large sets of data efficiently and effectively to proactively identify trends in the industry and validate hypotheses</li><li>Keep track of industry news and new products in order to regularly share notable developments with North America leadership team</li><li>Mentor and provide on-the-job training to junior members of the BizOps team</li></ul><strong>Qualifications<br/><br/></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>4 years of work experience with a Bachelors Degree or at least 2 years of work experience with an Advanced degree (e.g. Masters, MBA, JD, MD) or 0 years of work experience with a PhD degree <br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>7-10 years of work experience with a Bachelors Degree or 6 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD. UR Only: MBA/ PhD degree without experience. </li><li>4+ years Prior BizOps experience and payments industry experience helpful</li><li>Exceptional problem solving skills, able to multi-task and manage competing priorities</li><li>Highly organized</li><li>Intellectually curious about the payments industry and the cards business</li><li>Composure and clarity required to interact with senior management and executives</li><li>Ability to influence others, e.g., cross-functional stakeholders and leaders, and experience presenting information to all levels with ability to facilitate group discussions</li><li>Strong written and verbal communication skills</li><li>Work with limited direction, usually within a complex and often ambiguous environment, to drive rigorous, fact-based recommendations and solutions</li><li>Team oriented, collaborative and diplomatic</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Work Authorization<br/></u></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position<u><strong>.<br/><br/><br/></strong></u></li></ul><strong><u>Travel Requirements<br/></u></strong><ul><li>This position requires the individual to travel 0-10% of the time.<br/><br/></li></ul><strong><u>Work Hours<br/></u></strong><ul><li>Incubment must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Physical Requirements<br/></u></strong><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms.<br/></li></ul><u><strong>EEO<br/></strong></u><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF21755L</div>"}, {"id": 55166048, "source": "linkedin", "position": "Product Owner, DPS", "company": "Visa", "city": "Highlands Ranch  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Engineering", "Information Technology", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Engineering", "epoch": 1515473134, "url": "https://www.linkedin.com/jobs/view/product-owner-dps-at-visa-1458282351?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=10&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>Visa DPS is looking for a highly motivated and experienced Product Owner to join the team!<br/><br/>The Product Owner&amp;aposs primary responsibility is to build products and solutions that deliver delightful experiences with a substantial value propositions across the payments ecosystem.<br/><br/><strong><u>This Product Owner Will<br/></u></strong><ul><li>Work closely with clients, partners, business unit leaders, engineering, architects, user experience and global cross-functional counterparts to build, iterate and refine new issuer processing solutions. </li><li>Interact with executives and others in client and partner organizations to brainstorm co-creation ideas, develop user stories, and bring new product features to market.</li><li>Work closely with Product Strategy, Product Leads and Technology as part of an agile work team(s) supporting development and commercialization of new features.</li><li>Bring prior experience in hands-on development of product solutions, and a close knowledge of developments in issuer-processing and payment related technology.</li><li>Creative and hands-on, has a bias towards action and is able to inspire others with their vision. <br/></li></ul>This Product Owner will report to the Sr. Director, Product Manager.<br/><br/><strong><u>Basic Qualifications<br/><br/></u></strong><strong>Qualifications<br/></strong><ul><li>4 years of work experience with a Bachelor’s Degree or at least 2 years of work experience with an Advanced degree (e.g. Masters, MBA, JD, MD) or 0 years of work experience with a PhD degree<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>7-10 years of work experience and a Bachelor’s Degree or 6 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD.</li><li>Strong product development skills with a sound understanding of payment technology, risk and fraud management, other ecosystem requirements</li><li>Prior experience working within an agile product development environment, as well as familiarity or experience with issuer processing technology</li><li>3+ years of experience in the payments industry (e.g. payment processing, acquiring, payment technology provider, payment brand etc.)</li><li>3+ years of experience in technical or business product management </li><li>3+ years&amp;apos experience with agile (SAFE) product development methodology preferred</li><li>Excellent communication skills and executive presence</li><li>Aptitude to collaborate with engineering teams to build robust, reliable and scalable payment solutions</li><li>Highly execution focused by working in conjunction with various counterparts</li><li>Ability to think creatively to solve problems</li><li>Organizational and leadership abilities to influence, negotiate and drive results</li><li>Experience working with external partners in collaborative development</li><li>Knowledge in issuer processing technology or solutions</li><li>Experience and knowledge of Agile (Scrum) project methodology and practices</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Work Authorization<br/></u></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/></li></ul>Work Hours<br/><ul><li>Incumbent must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Travel<br/></u></strong><ul><li>Incumbent must be able to travel up to 25%<br/></li></ul>Physical Requirements<br/><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.<br/></li></ul>EEOC<br/><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF20515I</div>"}, {"id": 55017073, "source": "linkedin", "position": "Director, Product Strategy - DPS", "company": "Visa", "city": "Highlands Ranch  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Product Management", "Marketing", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Product Management", "epoch": 1515473134, "url": "https://www.linkedin.com/jobs/view/director-product-strategy-dps-at-visa-1458282404?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=11&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>Visa DPS is a product division within Visa, Inc. that drives payments innovation through unique market leading issuer processing platforms and product solutions. As Director, Visa DPS Strategy, this position will work closely with various teams across Visa to successfully launch, commercialize and scale our business in new products, markets, and channels.<br/><br/>This position will translate market needs into business and technical requirements for digital solutions. The role requires a broad range of skills – familiarity with digital payment technologies and the ability to identify opportunities.<br/><br/><strong><u>The Primary Responsibility Will Be<br/></u></strong><ul><li>Deployment of a next generation issuer processing platform to structure projects and/or programs across emerging fintech uses cases.</li><li>Responsible for managing multiple initiatives including business case development, funding needs and P&amp;L.</li><li>Define and track project milestones.</li><li>Provide project status reports.</li><li>Oversee scope to ensure commitments are achieved within agreed time, cost, and quality parameters.</li><li>Represent the team in various project update meetings and be part of client meeting to guide them in the process.</li><li>Responsible for early identification of issues, determining potential resolutions, communicating status, tracking and resolving them in a timely manner.</li><li>Development of go-to-market (GTM) solutions and overall commercialization. </li></ul><strong>Qualifications<br/><br/></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>10 years of work experience with a Bachelor’s Degree or at least 8 years of work experience with an Advanced Degree (e.g. Masters/MBA/JD/MD) or at least 3 years of work experience with a PhD <br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>12-15 years of work experience with a Bachelor’s Degree or 8-10 years of experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 6+ years of work experience with a PhD Professional/Technical/Business</li><li>Experience in chip, contact and contactless technologies</li><li>Knowledge of Digital Payments, including issuer processing technologies</li><li>Credit/Debit/Prepaid cards and financial / payment industry knowledge</li><li>Technical background and hands-on experience </li><li>Product Development or Project Management experience working in agile methodology</li><li>Excellent communication skills, including verbal, written and presentation necessary</li><li>Project management in high-tech industry or consulting services</li><li>Experience incorporating technology into real business applications</li><li>Experience preparing comprehensive competitive analysis, RFIs and RFPs</li><li>Experience in product development</li><li>Experience in a range of functions including strategy, marketing, operations and finance</li><li>International exposure and experience (Europe, Asia Pacific)</li><li>Knowledge / Experience working with APIs</li><li>Consulting services with international exposure</li><li>Sales, marketing and product development</li><li>Track record of increasing responsibility</li><li>Ability to communicate with both business and technology leaders, with a strong understanding of business data requirements and technology capabilities and an ability to make technical concepts accessible to non-technical audiences.</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Work Authorization<br/></u></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/></li></ul>Work Hours<br/><ul><li>Incumbent must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Travel<br/></u></strong><ul><li>Incumbent must be able to travel up to 25%<br/></li></ul>Physical Requirements<br/><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.<br/></li></ul>EEOC<br/><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF20514M</div>"}, {"id": 55416579, "source": "linkedin", "position": "Senior Director, DPS Product Manager", "company": "Visa", "city": "Highlands Ranch  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Product Management", "Marketing", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Product Management", "epoch": 1515473135, "url": "https://www.linkedin.com/jobs/view/senior-director-dps-product-manager-at-visa-1458282418?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=12&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>Visa DPS focuses on building and deploying innovative issuer processing technologies to enable and secure Visa transactions around the globe. Our mission is to launch new, market-leading offerings that create tremendous value for Issuers and Emerging Payments Providers, and delight end consumer users as well as meet clear areas of demand for payment and related services.<br/><br/>To effect this transformation across the globe, we are looking for leaders who are passionate about innovating and delivering truly differentiated user experiences as the lead over a small team of product owners.<br/><br/>Successful execution of this role will be achieved through a combination of leadership, payments and delivery knowledge, communication and applied strategy in applying DPS solutions to emerging use cases.<br/><br/>The Visa DPS Product Manager will work with stakeholders across Technology, Sales, and Client Support (CS) to deliver effective issuer processing solutions. In addition, this role will contribute to the overall strategic vision, planning and operation of the Visa DPS business and requires strong change management and C-level skills. This is a matrix, cross functional role so organizational savvy and interpersonal skills are critical. This role will interface across regions and multiple markets and engage with specialized product groups, financial institution sales, merchant sales, client consulting, operations, technology, risk, analytics, marketing and corporate communications, legal, corporate strategy, interchange/pricing, finance to coordinate the build, launch and support of new and existing products.<br/><br/>Visa DPS is looking for individual that pays attention to detail, with a proven track record of success in fast-paced product development environments (SAFE/Agile frameworks) with demanding timelines, an ability to correlate data and trends to business drivers, but who can also think big and contribute to strategic planning, drive change management and lead executive messaging.<br/><br/>Successful candidates will take ownership of most non-financial planning, program management, reporting and communications consistent with our product strategy, drive to increase usage / overall value and ultimately build Visa DPS brand loyalty. This position may require occasional travel to Visa sites and client sites around the globe.<br/><br/><strong><u>Essential Functions<br/></u></strong><ul><li>Successful candidate will have experience working in a fast-paced product development lifecycle, preference for experience with SAFE/agile/SCRUM development frameworks.<br/><br/></li></ul><strong><u>Key Responsibility Is To Develop The Processes And Systems That Enable Efficient Tracking, Reporting, And Follow Up With a Broad Cross-functional Team, Including<br/></u></strong><ul><li>Business / strategy contributions</li><li>Market capability requirements</li><li>Performance tracking against market, regional and enterprise goals</li><li>Commercialization and go-to-market strategies (GTM)</li><li>Product development </li><li>Operations <br/></li></ul>Responsible for leading projects / project teams and developing plans and schedules to drive deliverables to on time and on budget delivery. This Senior Director manages a group of Product Owners, and will be reporting to the Forward GM.<br/><br/><strong><u>Basic Qualifications<br/><br/></u></strong><strong>Qualifications<br/></strong><ul><li>12 years of work experience with a Bachelor’s Degree; 10 years of work experience with an Advanced degree (e.g. Masters/MBA/JD/MD); or a minimum of 5 years of work experience with a PhD<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>15-18 years of experience with a Bachelor’s Degree or 12 years of experience with an Advanced Degree (e.g. Masters, MBA, JD, MD or PhD)</li><li>Strong attention to detail</li><li>Excellent problem solving skills with a strong focus on serving clients</li><li>Experience managing and leading teams of product development professionals</li><li>Demonstrated thought leadership and the aptitude to think creatively and identify new ways to innovate and differentiate with evidence of tangible business results</li><li>Passionate about what you do and fired up about the opportunity to transform payments working for the industry leader</li><li>Strong team player, self-motivated and the ability to work independently at coordinating cross functional activities, data collection, buy-in and strong decision making abilities to elevate issues at critical junctures appropriately</li><li>Outstanding executive communication skills to develop presentations, associated summaries, and back up materials for program reporting.</li><li>Expert skills with MS Word, Excel, PowerPoint and Cloud tracking tools are required</li><li>Excellent communication skills, including verbal, written and presentation necessary</li><li>Active listening skills required </li><li>Proven project development experience</li><li>Strong sense of urgency and experience driving to successful commercialization</li><li>Ensure personal efforts are integrated and aligned with functional objective</li><li>Strong collaboration and influence skills to effectively lead cross-functional teams to drive deliverables, projects and engagements to completion</li><li> Take prompt, decisive action after analyzing relevant information</li><li>Ability to explain complex business and technical concepts to a broad audience </li><li>An advanced degree strongly preferred </li><li>Comfort leading and working closely with cross-functional teams required </li><li>Visa and financial/payment industry knowledge as well as issuer processing market experience is a plus, but not required</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Work Authorization<br/></u></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/></li></ul>Work Hours<br/><ul><li>Incumbent must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Travel<br/></u></strong><ul><li>Incumbent must be able to travel up to 25%<br/></li></ul>Physical Requirements<br/><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.<br/></li></ul>EEOC<br/><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF20516O</div>"}, {"id": 55191910, "source": "linkedin", "position": "Undergrad New College Grad - Business Development Associate, North America Sales", "company": "Visa", "city": "Highlands Ranch  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Sales", "Business Development", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Sales", "epoch": 1533617136, "url": "https://www.linkedin.com/jobs/view/undergrad-new-college-grad-business-development-associate-north-america-sales-at-visa-1483797505?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=13&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world&amp;aposs leader in digital payments technology, Visa&amp;aposs mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company&amp;aposs dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You&amp;aposre</strong> an Individual. <strong>We&amp;aposre</strong> the team for you. <strong>Together</strong>, let&amp;aposs transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>This New College Graduate, Business Development Associate role is within the North America Sales function. This role is responsible for developing account strategies to increase revenues from existing accounts along with ensuring implementation of annual sales goals and plans. Qualified candidates will show an ability to quickly build relationships internally and within their territory while also demonstrating a desire and capability to excel in other sales roles within the organization.<br/><br/><strong><u>Essential Functions<br/></u></strong><ul><li>Develop and execute customized territory plans to increase sales volume and market share within financial institutions in the region.</li><li>Develop a comprehensive understanding of all Visa products and services, including EFT processing services</li><li>Create new sales and revenue generating opportunities as appropriate</li><li>Expand existing relationships/partnerships through the selling of Visa products and services</li><li>Utilize a consultative sales approach that ensures that the Client’s business objectives are met and that the performance metrics of their payment portfolios are maximized</li><li>Continuously review payment landscape and recommend, develop, and implement new and creative approaches to growing Visa’s issuer business</li><li>Ensure implementation of annual goals and plans</li><li>Foster productive relationships at all levels with the client and the Visa organization</li><li>Develop an understanding of the Financial Institution’s business including payment strategy across all product platforms</li><li>Participate in sales meetings and training activities</li><li>Provide Salesforce client database support and reporting<br/></li></ul>This position is full-time and will be located in <strong>Highlands Ranch, CO<br/><br/></strong><strong><u>Qualifications<br/><br/></u></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>Minimum of 6 months of work experience or a Bachelor&amp;aposs Degree</li><li>Graduating with a Bachelor&amp;aposs Degree as of December 2019 thru August 2020<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>2 or more years of work experience</li><li>Excellent written and verbal communication skills</li><li>Demonstrated accomplishments in academic and previous work experience</li><li>Willingness to learn and execute effectives sales strategies for new payment products and services</li><li>Ability to develop, lead and close complex competitive sales efforts</li><li>Strong analytical and strategic planning skills</li><li>Demonstrated professionalism with trouble shooting/problem solving skills</li><li>Confidence and ability to effectively create and deliver presentations to all audiences</li><li>Ability to coordinate internal and external resources and nurture cross functional relationships</li><li>Ability to negotiate business agreements and enhance existing and new relationships</li><li>Demonstrated understanding of financial indicators to measure business performance and an ability to summarize business and financial data in a useful manner for planning and decision</li><li>Proficient in PowerPoint and Excel<br/><br/></li></ul><strong><u>Additional Information<br/><br/></u></strong><u><strong>Travel Requirements: <br/></strong></u><ul><li>This position requires the individual to travel 0% to 25% of the time.<br/><br/></li></ul><strong><u>Work Hours<br/></u></strong><ul><li>Incumbent must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Work Authorization<br/></u></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/><br/></li></ul><strong><u>Physical Requirements<br/></u></strong><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms.<br/></li></ul><u><strong>EEO<br/></strong></u><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF22047Q</div>"}, {"id": 55605546, "source": "linkedin", "position": "Principal, North America Product, Client Implementation Technical Lead", "company": "Visa", "city": "Foster City  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Consulting", "Information Technology", "Sales", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Consulting", "epoch": 1551761137, "url": "https://www.linkedin.com/jobs/view/principal-north-america-product-client-implementation-technical-lead-at-visa-1445172908?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=14&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the #1 payments company in the world, tech is at the heart of what we do. We offer some of the most innovative products in the world and we maintain a razor sharp focus on the next generation of payment products and activities. We are investing in the next generation of talent to ensure our products, services and data are the center of the changing ways people pay and get paid.<br/><br/>Visa is a globally recognized brand that carries a keen passion for social responsibility. We are associated with and sponsor other prominent brands such as the Olympics and FIFA World Cup. As such, we are fueled by our diverse team of talented team-members who continuously raise the bar on delivering best-in-class product and services to people all over the world. Join our team and find out how Visa is everywhere you want to be.<br/><br/><strong><u>Job Description<br/><br/></u></strong>Come work directly with Visa&amp;aposs most innovative clients. Join the fast-paced world of launching Visa&amp;aposs latest products and releases. Be responsible for bringing new payments use-cases to life in the US.<br/><br/>Visa&amp;aposs North America Product Go-to-Market and Solutions Implementation team are responsible for integrating Visa&amp;aposs issuer, merchant, acquirer, and technology partner clients with Visa&amp;aposs wide range of product offerings including, Visa Token Service, Secure Remote Commerce, Installments, and related value-added services.<br/><br/>The US Product Implementation team is made up of client-facing sales engineers, project managers, and technical integration managers, who manage many concurrent integration projects across different client types, products, and implementation use cases. The Client Implementation Technical Lead will act as the primary technical product SME on client-facing implementation projects responsible for the requirements definition, development, and QA support to the client&amp;aposs technical teams, client onboarding and configuration, solution approval, and managing any technical inquiries and escalations. Depending on the size of the project, the Technical Lead may be responsible for the full accountability of the implementation including project and relationship management during the course of the implementation. The Technical Lead will also act as a central point of contact into Visa&amp;aposs global product organizations, staying in touch with product roadmaps, releases, and feature requests.<br/><br/><strong><u>Responsibilities<br/></u></strong><ul><li>Provide functional, technical and certification requirements for integration to Visa&amp;aposs products and services to key enterprise clients.</li><li>Create, maintain and execute solution designs while working hand in hand with the client implementation manager.</li><li>Work with development, architecture and the technology teams to track down key knowledge and answers to questions before, during and after the implementation process.</li><li>Create a streamlined process for supporting clients throughout the implementation process with a focus on successful scalable patterns.</li><li>Create and execute a technical implementation plan with every client. You will be responsible for the successful delivery of each client from a technology perspective.</li><li>Track down, triage and solve issues for client integrations in a timely efficient manager.</li><li>Focus on becoming a subject matter expert for clients with regards to all of Visa&amp;aposs priority products.</li><li>Engage in complex problem solving with key internal players as well as key external partners.</li><li>Manage technical client implementations with key clients to ensure that interactions are well organized and objectives are clear.</li><li>Act as a liaison between the global product teams, product technology teams and clients to track down issues, answer inquiries and deliver a successful integration.</li><li>Should be able to design and develop web applications and REST APIs and lead a technical team to develop and maintain integration tools and demos.</li></ul><strong>Qualifications<br/><br/></strong><strong><u>Qualifications<br/><br/></u></strong><strong><strong>Minimum<br/></strong></strong><ul><li>BA/BS degree in Computer Science, or related technical field, or equivalent career experience<br/><br/></li></ul><strong><u>Preferred<br/></u></strong><ul><li>10+ years&amp;apos experience, preferably in payments / retail banking / emerging mobile technologies</li><li>Strong client-facing communication skill-set.</li><li>Good written and verbal communication skills, interpersonal and presentation skills and the proven ability to influence and communicate effectively</li><li>Candidate must be a self-starter and have a disposition to work independently with a commitment to detail in an organized manner</li><li>Demonstrated strong problem solving, logic and analytical skills; ability to prioritize work and participate in a number of projects simultaneously.</li><li>Must have experience in working with web services</li><li>Ability to code in any one or multiple languages (Java, NodeJS, Python, etc.).</li><li>Working front-end knowledge of HTML, CSS and JavaScript.</li><li>Practical experience in design and development of applications with major web development frameworks (Angular, React, etc.).</li><li>Technical written and presentation communication skills are essential; must be able to present technical topics to customers.</li><li>Own the work you deliver whether working with cross functional teams or individually; Be self-driven to succeed.</li><li>Passionate about emerging technology and using it to create innovative experiences.</li><li>Familiarity with mobile industry standards and application development for Android or iOS is a plus.<br/><br/></li></ul><strong><u>Work Hours<br/><br/></u></strong><strong>Additional Information<br/><br/></strong>Incumbent must make themselves available during core business hours. May require occasional meetings outside of core business hours to connect with global partners.<br/><br/><strong><u>Travel Requirements<br/><br/></u></strong>This position requires the incumbent to travel for work <strong>10%</strong> of the time<br/><br/><strong><u>Physical Requirements<br/><br/></u></strong>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers.<br/><br/>Job Number: REF20597N</div>"}, {"id": 55583614, "source": "linkedin", "position": "Undergrad Intern: Global Merchant & Acquiring – Fintech Partnership Sales", "company": "Visa", "city": "Foster City  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Sales", "Business Development", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Sales", "epoch": 1533617137, "url": "https://www.linkedin.com/jobs/view/undergrad-intern-global-merchant-acquiring-%E2%80%93-fintech-partnership-sales-at-visa-1483182392?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=15&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>Common Purpose, Uncommon Opportunity. Everyone at Visa works with one goal in mind - making sure that Visa is the best way to pay and be paid, for everyone everywhere. This is our global vision and the common purpose that unites the entire Visa team. As a global payments technology company, tech is at the heart of what we do: Our VisaNet network processes over 13,000 transactions per second for people and businesses around the world, enabling them to use digital currency instead of cash and checks. We are also global advocates for financial inclusion, working with partners around the world to help those who lack access to financial services join the global economy. Visa&amp;aposs sponsorships, including the Olympics and FIFA™ World Cup, celebrate teamwork, diversity, and excellence throughout the world. If you have a passion to make a difference in the lives of people around the world, Visa offers an uncommon opportunity to build a strong, thriving career. Visa is fueled by our team of talented employees who continuously raise the bar on delivering the convenience and security of digital currency to people all over the world. Join our team and find out how Visa is everywhere you want to be.<br/><br/><strong><u>Job Description<br/><br/></u></strong>This is a sales support role within the Global Merchant &amp; Acquiring – Fintech Partnership Sales organization, a team dedicated to strengthening Fintech partnerships across North America. This Intern will be tasked with supporting various sales and enablement projects that drive important Visa products and initiatives into the Fintech ecosystem.<br/><br/><strong><u>These Projects May Include<br/><br/></u></strong><strong>Essential Functions:<br/></strong><ul><li>Developing a go-to-market strategy for new or existing products and services.</li><li>Researching market trends and cross referencing findings with client input received by Account Executives.</li><li>Creating content to be presented to clients or internal stakeholders.</li><li>Tracking sales pipeline statuses within CRM software and communicating updates to sales team.</li></ul><strong>Qualifications<br/><br/></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>Must have a High School diploma or equivalent</li><li>Students graduating Dec 2020 or later (unless enrolled to pursue an additional degree in spring 2020)<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>1 or more years of work experience</li><li>Pursuing a Bachelor&amp;aposs degree in Business, Economics, Finance, Information Systems, Communications or a related field<br/><br/></li></ul><strong><u>Key Competencies<br/></u></strong><ul><li>Proficient in Microsoft PowerPoint, Word and Excel</li><li>Excellent written and verbal communication skills</li><li>A team player willing to collaborate with others</li><li>Curious problem solver with a solution-oriented mindset</li><li>Open to continuously learning and growing</li><li>Entrepreneurial and resourceful with the ability to own tasks and projects</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Work Authorization<br/></u></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/></li></ul><u>Work Hours<br/></u><ul><li>Intern must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Physical Requirements<br/></u></strong><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms.<br/></li></ul><u>EEO<br/></u><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law. All your information will be kept confidential according to EEO guidelines.<br/></li></ul>Job Number: REF22001R</div>"}, {"id": 55909628, "source": "linkedin", "position": "Director - Product Manager, Payment Security and Key Management", "company": "Visa", "city": "Bellevue  WA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Product Management", "Engineering", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Product Management", "epoch": 1515473138, "url": "https://www.linkedin.com/jobs/view/director-product-manager-payment-security-and-key-management-at-visa-1368769565?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=16&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>Common Purpose, Uncommon Opportunity. Everyone at Visa works with one goal in mind – making sure that Visa is the best way to pay and be paid, for everyone everywhere. This is our global vision and the common purpose that unites the entire Visa team. As a global payments technology company, tech is at the heart of what we do: Our VisaNet network processes over 13,000 transactions per second for people and businesses around the world, enabling them to use digital currency instead of cash and checks. We are also global advocates for financial inclusion, working with partners around the world to help those who lack access to financial services join the global economy. Visa’s sponsorships, including the Olympics and FIFA™ World Cup, celebrate teamwork, diversity, and excellence throughout the world. If you have a passion to make a difference in the lives of people around the world, Visa offers an uncommon opportunity to build a strong, thriving career. Visa is fueled by our team of talented employees who continuously raise the bar on delivering the convenience and security of digital currency to people all over the world. Join our team and find out how Visa is everywhere you want to be.<br/><br/><strong><u>Job Description<br/><br/></u></strong><em>CyberSource and Authorize.Net are launching exciting and innovative products in the payment space. Product Managers are the architects of CyberSource and Authorize.Net product offerings and the key drivers of product line success and merchant and partner adoption. They drive the product line vision &amp; strategy and its delivery and execution across the organization. The platform on which the products are built include, not only technology infrastructure, but also must be architected in such a way as to allow for growth and innovation within the product lines.<br/><br/></em><em>CyberSource and Authorize.Net partner with merchant acquirers and technology partners around the globe to provide consolidated merchant acceptance solutions to merchants of all sizes. The <u>Director, Product Management - Payment Security &amp; Key Management</u> will be responsible for leading a cross-functional team that sponsors and defines the business and technology requirements for card present solutions. The ideal candidate will have experience delivering point of sale (POS) solutions to merchants as an acquirer/processor or technology solution provider and/or implementing POS solutions. Candidates will have experience working with internal and external stakeholders to define the needs of the business and sponsor initiatives that drive the business forward.<br/><br/></em><strong><u>Specific Responsibilities Will Include<br/></u></strong><ul><li><em>Understanding and tracking the evolving payments market through customer outreach and competitive analysis</em></li><li><em>Defining product vision and articulating feature requirements to product development teams</em></li><li><em>Defining and managing product roadmaps </em></li><li><em>Developing business cases and managing strategic product planning</em></li><li><em>Driving alignment with sponsors, business stakeholders, architecture, user experience and security teams to ensure designs meet market requirements</em></li><li><em>Managing customer-facing/internal commercialization readiness and product lifecycle planning with cross functional teams through beta, pilot, general availability and end-of-life stages</em></li><li><em>Lead the new strategy, vision, roadmap, infrastructure definition, and feature-set implementation of security, encryption, key management and certificate management products for payment acceptance devices</em></li><li><em>Set a high bar for product management excellence, enforcing a culture of product development that is agile, user-focused, and based on rapid execution of small, measurable successes.</em></li><li><em>Prepare and implement go-to-market strategies, ensuring successful launch execution.</em></li><li><em>Work with our own global security team and our customers and partners to ensure the seamless operation of a global security system.</em></li><li><em>Own the results. Analyze KPI’s and use them to drive decision-making about the future of the product</em></li><li><em>Become the go-to person for your products. Develop best practices</em></li></ul><strong>Qualifications<br/><br/></strong><strong><u>Qualifications<br/></u></strong><ul><li><em>Bachelor&amp;aposs Degree required</em></li><li><em>7+ years of Product Management experience required, 2 years focused on POS payments</em></li><li><em>Strong understanding of physical POS payments including hardware, software and processor solutions for POS including EMV and digital payments </em></li><li><em>Financial services/payments, ecommerce, and mobile commerce industry experience a strong plus</em></li><li><em>Creative spark – in product innovation, product management, and finding ways to get things done</em></li><li><em>Team player, with proven track record of taking initiative and ownership of responsibilities and deliverables</em></li><li><em>Experience in structuring cross-channel solutions for enterprise, mid-market and small business merchants with Physical and E-commerce business lines</em></li><li><em>Strong understanding of Credit and Debit processing at POS including PIN debit, Chip and Pin/EMV processing worldwide</em></li><li><em>Experience in PCI compliance programs with a strong knowledge of PCI data security standard (PCI DSS) and requirements on application security</em></li><li><em>Knowledge of digital certificates, encryption key management, remote key loading, application signing and principles of information security using encryption.</em></li><li>Experience with Payments security standards bodies, such as PCI and ANSI X9.</li><li><em>Knowledge and experience with the physical device lifecycle including terminal manufacturers and VAR resellers and support organizations will be necessary</em></li><li><em>Experience with mobile payment acceptance for field based merchants and small business merchants</em></li><li><em>Adept at flexing to multiple planning and product development methodologies</em></li><li><em>Strong understanding of merchant business metrics in a cross-channel environment</em></li><li><em>The ability to identify, document and prioritize use cases and product functionality requirements for the execution of a cohesive product offering</em></li><li><em>Proven record of designing and delivering solutions in partnership with sales, business development, technology and support teams for successful end-to-end product launch</em></li><li><em>Exceptional written and oral communication skills, exceptional interpersonal skills and the proven ability to influence and communicate effectively across regional and functional lines</em></li><li><em>Ability to work independently within a complex and often ambiguous environment, to drive rigorous, fact-based recommendations to stakeholders and to juggle multiple initiatives at once</em></li><li><em>Demonstrated interpersonal and change management skills with the ability to thrive in a fast-paced environment; self-motivated, self-managed</em></li><li><em>Outstanding communication skills with the ability to interface with internal and external clients and partners at all levels</em></li><li><em>Strong analytical, planning and project management experience with strong problem solving capabilities with proven ability to lead projects end-to-end to meet client commitments</em></li><li><em>Demonstrated ability to work with large, cross-functional (e.g. product, business development, sales, strategy, marketing) and cross-regional teams in a complex, highly matrixed organization to determine business and customer needs and to build solutions to meet those needs</em></li><li><em>Ability to measure and analyze product performance and ROI to use in driving improved adoption<br/><br/></em></li></ul><strong><u>Additional Information<br/><br/></u></strong>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Article 49 of the San Francisco Police Code.<br/><br/>All your information will be kept confidential according to EEO guidelines.<br/><br/>Job Number: REF12006X</div>"}, {"id": 55244023, "source": "linkedin", "position": "Director, Cybersecurity Change Management", "company": "Visa", "city": "Foster City  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Other", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Other", "epoch": 1515473139, "url": "https://www.linkedin.com/jobs/view/director-cybersecurity-change-management-at-visa-1346728669?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=17&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re</strong> the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong><strong><u>Core Responsibilities<br/><br/></u></strong>Planning<br/><ul><li>Establish and implement a Change Management Framework for Cybersecurity</li><li>Align the Change Management Framework with the Visa Change Management Methodology</li><li>Build relationships and work with key stakeholders across the global Cybersecurity to execute the Change Management Strategy and Plan</li><li>Implement a Change Agent Network across Cybersecurity</li><li>Execute a change management program within strategic Cybersecurity work streams and act in an advisory role to Change Agents, helping them to understand, prepare for and embrace change.<br/></li></ul>Communication &amp; Engagement<br/><ul><li>Design and develop communication plans and related deliverables, ensuring messaging and execution are consistent with organization’s vision and principles</li><li>Tailor program communication materials to maximize relevancy and effectiveness with targeted audiences</li><li>Assist in the coordination of regional and local change activities (engagement events, workshops) as necessary<br/></li></ul>Impact Management &amp; Readiness<br/><ul><li>Work with functional and local leaders to identify change impacts specific to their areas</li><li>Facilitate the measurement of change readiness with Cybersecurity initiatives</li><li>Develop, prioritize and lead the execution of action plans required to mitigate impacts and readiness gaps</li><li>Coordinate with Change Agents within Cybersecurity and across Visa at large to effect readiness</li><li>Partner with program and project managers to educate and enhance focus on change management within initiatives</li><li>Align training needs with overall change management plans</li></ul><strong>Qualifications<br/><br/></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>10 years of work experience with a Bachelor’s Degree or at least 8 years of work experience with an Advanced Degree (e.g. Masters/MBA/JD/MD) or at least 3 years of work experience with a PhD</li><li>Experience applying change management frameworks to a variety of types of projects<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>Experience leading full life-cycle change activities, including vision setting, leadership/change sponsor alignment and engagement, stakeholder analysis, impact identification, readiness assessment, communication strategies, education plans and measurement of adoption.</li><li>Experience coaching leadership and project team members to guide them through the change management process, including best practices, trends and lessons learned.</li><li>Highly proactive and independent, with strategic sense to identify, anticipate and mitigate risks and issues</li><li>Strong written communications capabilities and editorial experience </li><li>Global / Multi-national experience</li><li>Master’s degree in Industrial / Organizational Psychology, Organizational Behavior, or other related field</li><li>Strong subject matter knowledge in areas of change management and organizational development (systems thinking, assessment</li></ul><ul><li>Executive presentation skills</li><li>Seasoned professional with well-developed analytical and problem-solving skills</li><li>Strong presence and interpersonal skills to interact with team, executives, colleagues, cross-functional teams, and third parties. Ability to manage competing business priorities.</li><li>Excellent listening and communication skills</li><li>Ability to clearly articulate messages to a variety of stakeholders and audiences</li><li>Ability to establish and maintain strong relationships at all levels of the organization, and strong track record influencing at all levels</li><li>Highly organized and detail oriented with a natural inclination for planning strategy and tactics</li><li>Acute business acumen and understanding of organizational issues and challenges</li><li>Change management certification or designation desired (e.g. Prosci, CCMP)<br/><br/></li></ul><strong><u>Preferred Experience In The Following Areas<br/></u></strong><ul><li>Culture change</li><li>Leadership development</li><li>Organization / operating model design</li><li>Change strategy and journey management</li><li>Organizational change capability building</li><li>Experience with the design and application of organization interventions</li><li>Experience facilitating large group workshops</li><li>Root cause analysis experience (5 why’s or similar) and identify action plans.</li><li>Experience applying recognized organization change management methodology in a complex organization</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Essential Functions<br/><br/></u></strong>As the Change Management Leader, you will play a key role in ensuring the Visa Cybersecurity organization embraces organizational change into each functional area as a key component for successful strategy execution. You will build strong relationships with Cybersecurity teams to become a trusted advisor, providing strategic change and communication support, with the goal of helping the Cybersecurity organization achieve its strategic objectives by driving to evolve and evangelize the Change Management Framework. You will lead the design and implementation of programs to enable adoption and sustainability of the Change Management Framework, which will include process, policy, system, technology, and organizational changes. This role will partner with the functional project teams to meet project objectives by creating and executing change management plans that maximize employee readiness and adoption and minimize resistance. You will collaborate with internal and external project leads to drive higher ultimate utilization of and proficiency with the changes that impact employees, thus increasing benefit realization, value creation, ROI and the achievement of project results and outcomes. You should have a strong understanding of fast-paced technology organizations, strong management skills and change management principles in order to be successful in this role. You must thrive in a dynamic, results-oriented work environment and be aligned to the Visa culture and values.<br/><br/><u><strong>Physical Requirements<br/><br/></strong></u>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.<br/><br/>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/><br/>Job Number: REF19426E</div>"}, {"id": 55668609, "source": "linkedin", "position": "Sr. Director, Cybersecurity Change Management", "company": "Visa", "city": "Foster City  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Other", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Other", "epoch": 1533617140, "url": "https://www.linkedin.com/jobs/view/sr-director-cybersecurity-change-management-at-visa-1486205611?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=18&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re</strong> the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong><strong><u>Core Responsibilities<br/><br/></u></strong>Planning<br/><ul><li>Establish and implement a Change Management Framework for Cybersecurity</li><li>Align the Change Management Framework with the Visa Change Management Methodology</li><li>Build relationships and work with key stakeholders across the global Cybersecurity to execute the Change Management Strategy and Plan</li><li>Implement a Change Agent Network across Cybersecurity</li><li>Execute a change management program within strategic Cybersecurity work streams and act in an advisory role to Change Agents, helping them to understand, prepare for and embrace change.<br/></li></ul>Communication &amp; Engagement<br/><ul><li>Design and develop communication plans and related deliverables, ensuring messaging and execution are consistent with organization’s vision and principles</li><li>Tailor program communication materials to maximize relevancy and effectiveness with targeted audiences</li><li>Assist in the coordination of regional and local change activities (engagement events, workshops) as necessary<br/></li></ul>Impact Management &amp; Readiness<br/><ul><li>Work with functional and local leaders to identify change impacts specific to their areas</li><li>Facilitate the measurement of change readiness with Cybersecurity initiatives</li><li>Develop, prioritize and lead the execution of action plans required to mitigate impacts and readiness gaps</li><li>Coordinate with Change Agents within Cybersecurity and across Visa at large to effect readiness</li><li>Partner with program and project managers to educate and enhance focus on change management within initiatives</li><li>Align training needs with overall change management plans</li></ul><strong>Qualifications<br/><br/></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>12 years of work experience with a Bachelor’s Degree or at least 10 years of work experience with an Advanced Degree (e.g. Masters/MBA/JD/MD) or at least 3 years of work experience with a PhD</li><li>Experience applying change management frameworks to a variety of types of projects</li><li>Experience in project management leadership<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>Experience leading full life-cycle change activities, including vision setting, leadership/change sponsor alignment and engagement, stakeholder analysis, impact identification, readiness assessment, communication strategies, education plans and measurement of adoption.</li><li>Experience coaching leadership and project team members to guide them through the change management process, including best practices, trends and lessons learned.</li><li>Experience managing projects directly or managing a team of project managers</li><li>Highly proactive and independent, with strategic sense to identify, anticipate and mitigate risks and issues</li><li>Strong written communications capabilities and editorial experience </li><li>Global / Multi-national experience</li><li>Master’s degree in Industrial / Organizational Psychology, Organizational Behavior, or other related field</li><li>Strong subject matter knowledge in areas of change management and organizational development (systems thinking, assessment</li><li>Executive presentation skills</li><li>Seasoned professional with well-developed analytical and problem-solving skills</li><li>Strong presence and interpersonal skills to interact with team, executives, colleagues, cross-functional teams, and third parties. Ability to manage competing business priorities.</li><li>Excellent listening and communication skills</li><li>Ability to clearly articulate messages to a variety of stakeholders and audiences</li><li>Ability to establish and maintain strong relationships at all levels of the organization, and strong track record influencing at all levels</li><li>Highly organized and detail oriented with a natural inclination for planning strategy and tactics</li><li>Acute business acumen and understanding of organizational issues and challenges</li><li>Change management certification or designation desired (e.g. Prosci, CCMP)</li><li>Project Management certification or designation desired (PMI, Prince)<br/><br/></li></ul><strong><u>Preferred Experience In The Following Areas<br/></u></strong><ul><li>Culture change</li><li>Leadership development</li><li>Organization / operating model design</li><li>Change strategy and journey management</li><li>Organizational change capability building</li><li>Experience with the design and application of organization interventions</li><li>Experience facilitating large group workshops</li><li>Root cause analysis experience (5 why’s or similar) and identify action plans.</li><li>Experience applying recognized organization change management methodology in a complex organization</li></ul><strong>Additional Information<br/><br/></strong><strong><u>Essential Functions<br/><br/></u></strong>As the Change Management Leader, you will play a key role in ensuring the Visa Cybersecurity organization embraces organizational change into each functional area as a key component for successful strategy execution. You will build strong relationships with Cybersecurity teams to become a trusted advisor, providing strategic change and communication support, with the goal of helping the Cybersecurity organization achieve its strategic objectives by driving to evolve and evangelize the Change Management Framework. You will lead the design and implementation of programs to enable adoption and sustainability of the Change Management Framework, which will include process, policy, system, technology, and organizational changes. This role will manage a team of project managers, along with partnering with the functional security teams to meet project objectives by creating and executing change management plans that maximize employee readiness and adoption and minimize resistance. You will collaborate with internal and external project leads to drive higher ultimate utilization of and proficiency with the changes that impact employees, thus increasing benefit realization, value creation, ROI and the achievement of project results and outcomes. You should have a strong understanding of fast-paced technology organizations, strong management skills and change management principles in order to be successful in this role. You must thrive in a dynamic, results-oriented work environment and be aligned to the Visa culture and values.<br/><br/><u><strong>Physical Requirements<br/><br/></strong></u>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.<br/><br/>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/><br/>Job Number: REF21647G</div>"}, {"id": 55664361, "source": "linkedin", "position": "Undergrad Intern - 2020 Visa DPS Product", "company": "Visa", "city": "Highlands Ranch  CO", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Education", "Training", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Education", "epoch": 1569300341, "url": "https://www.linkedin.com/jobs/view/undergrad-intern-2020-visa-dps-product-at-visa-1486733610?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=19&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You’re</strong> an Individual. <strong>We’re </strong>the team for you. <strong>Together</strong>, let’s transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong>The Product Intern will be a member of the Visa DPS Product team and will be responsible for assisting Directors and Product Managers with product work. The Intern will be assisting with the Debit Core payment transaction processing and authorization related services.<br/><br/><strong><u>The Product Intern Responsibilities Include<br/></u></strong><ul><li>Research, reporting, process documentation, product usage analytics and all aspects of project management work. </li><li>This position requires the ability to apply analytical and critical thinking skills to assist in solving business problems, and to recommend solutions to improve processes and drive continuous improvements in the product lines supported. <br/></li></ul>This position will be based in Highlands Ranch, Colorado.<br/><br/><strong><u>Qualifications<br/><br/></u></strong><strong><u>Basic Qualifications<br/></u></strong><ul><li>Must have a High School diploma or equivalent</li><li>Pursuing a Bachelor’s degree, graduating Dec. 2020 or later<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>1 or more years of work experience</li><li>Candidate must be working towards their BA or BS in: Computer Science, Information Systems, Information Technology, or Business Administration with an emphasis in technology strategy.</li><li>Strong work ethic; eager to contribute to the team’s success</li><li>Strong desire and aptitude to work hands-on with data and analytics</li><li>Excellent written and oral communication skills</li><li>Creative spark in working innovatively with long-established systems and processes</li><li>Team player who is able to work independently with general supervision</li></ul><strong>Additional Information<br/></strong><strong>Work Authorization: </strong>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/><br/><strong>Work Hours: </strong>This position requires the incumbent to be available during core business hours.<br/><br/><strong>Travel Requirements: </strong>This position requires the incumbent to travel for work up to 5% of the time.<br/><br/><strong>Mental/Physical Requirements: </strong>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, and reach with hands and arms.<br/><br/><strong>EEO Statement: </strong>Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/><br/>Job Number: REF22131G</div>"}, {"id": 55990278, "source": "linkedin", "position": "Account Executive, New Business", "company": "Visa", "city": "San Francisco  CA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Sales", "Business Development", "Consumer Services", "Financial Services", "Information Technology and Services"], "category": "Sales", "epoch": 1568090741, "url": "https://www.linkedin.com/jobs/view/account-executive-new-business-at-visa-1370313931?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=20&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Company Description<br/><br/></u></strong>As the world&amp;aposs leader in digital payments technology, Visa&amp;aposs mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company&amp;aposs dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br/><br/>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br/><br/><strong>You&amp;aposre</strong> an Individual. <strong>We&amp;aposre</strong> the team for you. <strong>Together</strong>, let&amp;aposs transform the way the world pays.<br/><br/><strong><u>Job Description<br/><br/></u></strong><strong>Position Description<br/><br/></strong>This new business sales role is responsible for identifying and executing partnership opportunities with emerging sectors.<br/><br/>The Account Executive, Business Development role requires an experienced sales and business development professional who can identify and secure new business in emerging issuance and payment categories across consumer and commercial sectors. Specific product solutions typically stem from debit and prepaid along with various payment and disbursement solutions. Although new use cases are emerging rapidly, and the products to support various solutions will vary.<br/><br/>Opportunities most often arise among 3rd parties, program managers and processors that participate in a sponsorship model (i.e., using a BIN sponsor bank and a processor).<br/><br/>The position will also work closely with various internal departments and external clients to ensure appropriate communication flows and sustained business relationships in the market. The position will play a significant role in developing pipeline and comprehensive sales strategies.<br/><br/>This position is ideally based in San Francisco but open to other U.S. office locations.<br/><br/><strong><u>Essential Functions Include<br/></u></strong><ul><li>Build and manage pipeline of new opportunities within an innovative marketplace seeking issuance and/or disbursement solutions</li><li>Create new opportunities and close deals that generate incremental revenue</li><li>Focus on expanding the pie and delivering net new volume on the network</li><li>Negotiate complex contracts</li><li>Develop and execute against comprehensive sales strategies</li><li>Deliver on agreed upon sales goals</li><li>Continuously review payment landscape and recommend, develop, and implement new and creative approaches to growing Visa&amp;aposs issuing and disbursements business</li><li>Provide operational or technical leadership within sales</li><li>Ensure implementation of team&amp;aposs annual goals and plans</li><li>Foster productive relationships at all levels within the Visa organization</li><li>Develop an understanding of the issuance and payments business including payment strategy across all product platforms</li><li>Actively participate and lead various ad-hoc internal projects as assigned</li><li>Participate in sales meetings and training activities</li><li>Develop a comprehensive understanding of all Visa products and services<br/><br/></li></ul><strong><u>Engaging With Prospects<br/></u></strong><ul><li>Expand the utility of Visa products and solutions by helping to develop new use cases with clients and prospects</li><li>Utilize a consultative sales approach that ensures that the client or prospect’s business objectives are met for the maximization of their portfolio performance</li><li>Foster in-depth and productive relationships at all levels with the client and the Visa organization so as to create a seamless transition to relationship management team</li><li>Work with cross-functional teams to ensure partner implementations are on track and delivering against plan, until successful transition over to relationship management team</li><li>Take the lead in solving the problems that arise during the execution of programs with partners</li><li>Assist marketing and product organization with insight into launching new products or expanding the penetration of existing products by providing market intelligence from prospects back into the organization<br/><br/></li></ul><strong><u>Basic Qualifications<br/><br/></u></strong><strong>Qualifications<br/></strong><ul><li>10 years of work experience with a Bachelors Degree; or at least 8 years of work experience with an Advanced degree (e.g. Masters/MBA/JD/MD); or a minimum of 3 years of work experience with a PhD<br/><br/></li></ul><strong><u>Preferred Qualifications<br/></u></strong><ul><li>12-15 years of experience with a Bachelors Degree or 8-10 years of experience with an Advanced Degree (e.g. Masters, MBA, JD, MD or PhD). Or 6+ years of work experience with a PhD.</li></ul><ul><li>Experience working with Venture Capitalists and/or Silicon Valley investment community</li><li>Card Issuing/Acquiring experience beneficial. Exposure to servicing Financial Institution clients in these areas is important. Related sales experience in the payments industry or similar experience in consulting.</li><li>Payments innovation knowledge is beneficial</li><li>Ability to develop, lead and close competitive deals</li><li>Proven ability to negotiate business agreements</li><li>Willingness to learn and execute effective sales strategies for new payment products and services</li><li>Proven ability to implement strategic initiatives with efficiency, professionalism and with demonstrated trouble shooting/problem solving skills</li><li>Excellent written and verbal communication skills</li><li>Confidence and ability to effectively create and deliver presentations to all audiences up to the executive levels</li><li>Ability to coordinate internal and external resources and nurture cross-functional relationships</li><li>Demonstrated understanding of financial indicators to measure business performance and an ability to summarize business and financial data in a useful manner for planning and decision-making</li><li>Proficient in Microsoft Word, Excel, and PowerPoint.<br/><br/></li></ul><strong><u>Work Authorization<br/><br/></u></strong><strong>Additional Information<br/></strong><ul><li>Authorization to work in the U.S. is a precondition of employment for this position. Visa will not sponsor applicants for work visas in connection with this position.<br/></li></ul>Work Hours<br/><ul><li>Incumbent must make themselves available during core business hours.<br/><br/></li></ul><strong><u>Travel<br/></u></strong><ul><li>Incumbent must be able to travel up to 30%<br/></li></ul>Physical Requirements<br/><ul><li>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.<br/></li></ul>EEOC<br/><ul><li>Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br/></li></ul>Job Number: REF19072J</div>"}, {"id": 55909156, "source": "linkedin", "position": "Analyst I Capital Markets & Sponsor Finance", "company": "Citizens Bank", "city": "Charlotte  NC", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Marketing", "Sales", "Banking"], "category": "Marketing", "epoch": 1568695542, "url": "https://www.linkedin.com/jobs/view/analyst-i-capital-markets-sponsor-finance-at-citizens-bank-1418847666?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=21&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Description<br/><br/></u></strong>Citizens Bank is seeking current college seniors to join the execution team within its Capital Markets &amp; Sponsor Finance Group (“Capital Markets”). Analysts within Capital Markets will work closely with the team’s senior professionals in originating, structuring and executing leverage finance transactions, primarily within the U.S. middle market.<br/><br/>Analysts' responsibilities include transaction support (idea generation, financial analysis, industry analysis, client communication), from origination through transaction closing, for multiple concurrent transactions. The Analyst within the Corporate Finance &amp; Sponsor Coverage Group will play a critical role in originating opportunities and coordinating projects interacting directly with senior management, other groups within Citizens, client management teams, private equity firms (“Sponsor”), and legal counsel. The Analyst will support industry aligned client coverage efforts and working closely with other Analysts and senior professionals in Debt Capital Markets, Leveraged Finance, Sponsor Coverage, and M&amp;A teams to originate and successfully execute a wide variety of transactions, including loan syndications, acquisition finance, high yield bonds, convertibles, and M&amp;A.<br/><br/><strong><em> Key Tasks &amp; Responsibilities include, but are not limited to: <br/></em></strong><ul><li> Supporting junior and senior team members within the Debt Capital Markets, Leveraged Finance, Sponsor Coverage, and M&amp;A teams to develop and pitch new ideas to help corporate clients and financial sponsors achieve their financial and strategic objectives </li><li> Performing extensive financial modeling and valuation analysis leveraging diligence findings to develop additional modeling scenarios, and present findings for internal approval teams </li><li> Conducting comprehensive company and industry research, and developing and maintaining thorough industry thought pieces and analyses for presentation to clients </li><li> Analyzing financial model output and client information to prioritize data and present conclusions for discussion purposes </li><li> Preparing pitch materials for client meetings </li><li> Participating in accounting, business and legal due diligence for both credit approval and underwriting approval processes </li><li> Preparing detailed transaction marketing materials and management presentations </li><li> Supporting junior and senior team members in developing new business ideas, pitch strategies, or transaction financing scenarios to help the firm’s corporate and sponsor clients with achieving their financial and strategic objectives <br/></li></ul>This position offers an excellent opportunity to join a high performing, rapidly growing, and entrepreneurial team within one of the largest regional banks in the country. Citizens Bank has market leading positions in middle market corporate and Sponsor-backed transactions. Through this experience, Analysts will gain insight into the issues and considerations for management teams, Sponsors, and shareholders at growing middle market companies; as well as gain exposure to strategic financial decision making at the highest management levels. Analysts will also develop direct working relationships with current and prospective clients, investment professionals at credit funds, professionals at other banks, and private equity firms. This position is for a two year analyst role, with the option for a third year, as well as assistance with placement for alternative positions within Citizens Financial Group, private equity firms, or other desired industry positions.<br/><br/>This opportunity carries a competitive salary and a discretionary annual bonus based on individual and firm achievement.<br/><br/><strong><u>Qualifications<br/><br/></u></strong><strong><em> General position requirements include: <br/></em></strong><ul><li> Ability to function as part of a flat organization, manage several projects at once, and work effectively both independently and as part of multiple teams </li><li> Excellent oral and written communication skills with the ability to express ideas in a persuasive, organized, and articulate manner </li><li> Demonstrated aptitude or willingness to master financial statement analysis, financial modeling, and company / industry analysis </li><li> Self-starting team player who can think strategically and excel in a fast-paced, entrepreneurial, and challenging work environment </li><li> Ability to follow-up independently and consistently and play the critical role as the project manager on assignments </li><li> High degree of maturity and integrity with a positive and hardworking attitude </li><li> Excellent attention to detail <br/><br/></li></ul><strong><u>Background Qualifications Include<br/></u></strong><ul><li> Please note that U.S.<strong> I</strong>mmigration sponsorship or work visa is not available for this position and candidates must have permanent authorization to work in the U.S. </li><li> Undergraduate candidates with a strong academic record and expected graduation date between December 2019 and June 2020. All majors / concentrations considered. </li><li> Minimum GPA of 3.2 preferred </li><li> Prior financial services internship experience preferred, but not required <br/></li></ul>Hours and Work Schedule<br/><br/>Hours per Week: 40<br/><br/>Work Schedule: Monday - Friday<br/><br/><strong>Why Work for Us<br/><br/></strong>At Citizens, you'll find a customer-centric culture built around helping our customers and giving back to our local communities. When you join our team, you are part of a supportive and collaborative workforce, with access to training and tools to accelerate your potential and maximize your career growth.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>It is the policy of Citizens Bank to provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to race, color, ethnicity, religion, gender, pregnancy/childbirth, age, national origin, sexual orientation, gender identity or expression, disability or perceived disability, genetic information, citizenship, veteran or military status, marital or domestic partner status, or any other category protected by federal, state and/or local laws.<br/><br/>Equal Employment and Opportunity Employer/Disabled/Veteran<br/><br/>Citizens Bank is a brand name of Citizens Bank, N.A. and each of its respective subsidiaries.</div>"}, {"id": 55882961, "source": "linkedin", "position": "Capital Markets & Sponsor Finance Summer Analyst", "company": "Citizens Bank", "city": "Boston  MA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Business Development", "Sales", "Banking"], "category": "Business Development", "epoch": 1568695543, "url": "https://www.linkedin.com/jobs/view/capital-markets-sponsor-finance-summer-analyst-at-citizens-bank-1418849219?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=22&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\"><strong><u>Description<br/><br/></u></strong>Citizens Bank is seeking current college juniors to join the execution team within its Capital Markets &amp; Sponsor Finance Group (“Capital Markets”). Through the 12-week program, Summer Analysts within Capital Markets will work closely with the team’s junior and senior professionals in originating, structuring and executing leverage finance transactions, primarily within the U.S. middle market.<br/><br/>Summer Analysts’ responsibilities will require significant and regular transaction involvement, from origination through closing, as well as the ability to work on multiple projects and transactions concurrently. Summer Analysts within the Capital Markets group play a critical role on their deal teams and interact directly with Managing Directors and other senior management members, other groups within Citizens Bank, client senior management teams, private equity investment teams, and legal counsel. Summer Analysts will work across a number of different industries and support the acquisition, leveraged buyout, dividend recapitalization, restructuring, and refinancing activity generated by the firm’s corporate and private equity (“Sponsor”) clients.<br/><br/><strong><em> Key Tasks &amp; Responsibilities include, but are not limited to: <br/></em></strong><ul><li> Supporting junior and senior team members within Debt Capital Markets / Leveraged Finance, Corporate Finance Industry Coverage, and Sponsor Coverage in the execution of leverage finance transactions </li><li> Playing a key leadership role throughout the transaction execution process </li><li> Preparing detailed investor marketing materials, including CIMs and lender presentations </li><li> Conducting accounting, business, and legal due diligence for both credit approval and underwriting approval processes </li><li> Performing extensive projection modeling for a variety of transaction scenarios, leveraging diligence findings to develop additional modeling scenarios, and presenting findings for internal approval teams </li><li> Working with the sales distribution team to develop syndication strategies and answering lender / investor due diligence questions during syndication </li><li> Working with legal counsel and clients / Sponsors to draft and negotiate all legal documentation </li><li> Organizing Ratings Agency Meetings, Lender Meetings, and Investor Roadshows for private and public debt offerings </li><li> Coordinating with senior bankers to provide indicative transaction structure and pricing guidance based on financial projection model and comparable transaction analysis </li><li> Supporting junior and senior team members in developing new business ideas, pitch strategies, or transaction financing scenarios to help the firm’s corporate and sponsor clients with achieving their financial and strategic objectives <br/></li></ul>This position offers an excellent opportunity to join a high performing, rapidly growing, and entrepreneurial team within one of the largest regional banks in the country. Citizens Bank has market leading positions in middle market corporate and Sponsor-backed transactions. Through this experience, Summer Analysts will gain insight into the issues and considerations for management teams, Sponsors, and shareholders at growing middle market companies; as well as gain exposure to strategic financial decision making at the highest management levels. Analysts will also develop direct working relationships with current and prospective clients, investment professionals at credit funds, professionals at other banks, and private equity firms. Depending on the Summer Analyst’s performance and the Group’s hiring needs, the Summer Analyst may receive an offer to join the Capital Markets Group for a full-time analyst position.<br/><br/><strong><u>Qualifications<br/><br/></u></strong><strong><em> General position requirements include: <br/></em></strong><ul><li> Ability to function as part of a flat organization, manage several projects at once, and work effectively both independently and as part of multiple teams </li><li> Excellent oral and written communication skills with the ability to express ideas in a persuasive, organized, and articulate manner </li><li> Demonstrated aptitude or willingness to master financial statement analysis, financial modeling, and company / industry analysis </li><li> Self-starting team player who can think strategically and excel in a fast-paced, entrepreneurial, and challenging work environment </li><li> High degree of maturity and integrity with a positive and hardworking attitude </li><li> Excellent attention to detail <br/><br/></li></ul><strong><u>Background Qualifications Include<br/></u></strong><ul><li> Please note that U.S. Immigration sponsorship or work visa is not available for this position and candidates must have permanent authorization to work in the U.S. </li><li> Undergraduate candidates with a strong academic record and expected graduation date between December 2020 and June 2021. All majors / concentrations considered. </li><li> Minimum GPA of 3.2 preferred </li><li> Prior financial services internship experience preferred, but not required </li></ul>Hours and Work Schedule<br/>Hours per Week: 40<br/>Work Schedule: Monday - Friday<br/><br/><strong>Why Work for Us<br/><br/></strong>At Citizens, you'll find a customer-centric culture built around helping our customers and giving back to our local communities. When you join our team, you are part of a supportive and collaborative workforce, with access to training and tools to accelerate your potential and maximize your career growth.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>It is the policy of Citizens Bank to provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to race, color, ethnicity, religion, gender, pregnancy/childbirth, age, national origin, sexual orientation, gender identity or expression, disability or perceived disability, genetic information, citizenship, veteran or military status, marital or domestic partner status, or any other category protected by federal, state and/or local laws.<br/><br/>Equal Employment and Opportunity Employer/Disabled/Veteran<br/><br/>Citizens Bank is a brand name of Citizens Bank, N.A. and each of its respective subsidiaries.</div>"}, {"id": 55692569, "source": "linkedin", "position": "Visa Sponsorship", "company": "Reap Healthcare Agents", "city": "Borough of Queens  NY", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Other", "Medical Devices", "Medical Practice", "Hospital & Health Care"], "category": "Other", "epoch": 1569818744, "url": "https://www.linkedin.com/jobs/view/visa-sponsorship-at-reap-healthcare-agents-1530060498?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=23&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">Immediate need for a BE/BC Family Med Physician to join a Community Health group in NYC. Lets discuss<br/><br/>recently trained candidates welcome<br/>J1 and H1B visa sponsorship available<br/>up to 110K loan repay<br/>full time / benefited<br/><br/><strong><u>Benefits Are As Follows<br/><br/></u></strong>A Board Certified Family Practice Physician for our Queens facility, Monday Friday, hours are three days of 9-5, one 11-7 day, and Fridays 8-4. $150,000 base plus incentive. A provider earns an incentive if they see more than 18 patients per day. They will earn $50 per patient over 18 seen per day. So, if they see 22 patients, they will earn an additional $200 that day. The last provider at this site earned approximately $188,000 in 2018. this is a standalone facility, and we staff a provider, front desk clerk, medical assistant, and a part-time LPN. There is no on call requirement. Must be comfortable seeing patients of all ages, including pediatrics.<br/><br/>Medical, Dental, and Vision there are a couple of different options to choose from. Most employees choose our base plan, which has a bi-weekly employee cost of $30/pay period for a single plan and $60/pay period for a family plan.<br/>Employer paid benefits we provide you with supplemental STD &amp; LTD, a life insurance policy valued at $50,000 and an accidental death and dismemberment policy valued at $50,000.<br/>4 weeks of vacation<br/>12 personal days<br/>11 paid holidays<br/>403(b) Retirement Savings Plan with 4% match after one year of employment<br/>Flexible Spending Plan<br/>TransitChek Commuter Benefit<br/>CME reimbursement of up to $1,000/year and up to five days off to complete a given years requirements, with supervisor approval.<br/><br/>MD / DO / Physician / Primary Care / Provider / Community Health</div>"}, {"id": 55163448, "source": "linkedin", "position": "visa sponsorship", "company": "Reap Healthcare Agents", "city": "Scranton  PA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Part-time", "Other", "Medical Devices", "Medical Practice", "Hospital & Health Care"], "category": "Other", "epoch": 1569818744, "url": "https://www.linkedin.com/jobs/view/visa-sponsorship-at-reap-healthcare-agents-1530057938?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=24&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">We are seeking a Psychiatrist to treat adults and/or children in a medically underserved outpatient facility in Pennsylvania. We offer flexible weekday hours with no call obligation. Our practice is patient-focused and collaborative. We offer an established practice with a stable patient population which will allow psychiatrist to focus on practicing psychiatry.<br/><br/>We offer competitive wages and a generous benefit package - available to full or part time staff -including:<br/>Medical, dental, vision, FSA<br/>Generous 403b<br/>Relocation assistance<br/>LTD, STD, Life Insurances<br/>Extensive Paid Time Off and CME allowance<br/>Malpractice insurance<br/>National and State Loan repayment<br/>Immigration waiver eligibility and assistance<br/>Our group in total has approximately 60 professionals and 300 employees. We are large enough to give you professional support but small enough to hear your voice.<br/><br/>Psych Psychiatry J1 visa H1b visa loan repayment</div>"}, {"id": 55692569, "source": "linkedin", "position": "Visa Sponsorship", "company": "Reap Healthcare Agents", "city": "Kent  WA", "country": ["United States"], "maxSalary": "0", "minSalary": "0", "currency": "USD", "language": ["English"], "tags": ["Full-time", "Other", "Medical Devices", "Medical Practice", "Hospital & Health Care"], "category": "Other", "epoch": 1569818745, "url": "https://www.linkedin.com/jobs/view/visa-sponsorship-at-reap-healthcare-agents-1530062016?refId=91a7448d-2d9c-4f65-bc2c-01177ced7eba&position=25&pageNum=0&trk=guest_job_search_job-result-card_result-card_full-click", "imgUrl": "linkedin", "description": "<div class=\"description__text description__text--rich\">Immediate need for a Family Med Physician to join a great group in Northern ME. Lets Discuss<br/><br/>Sign on bonus!<br/>loan repayment!<br/>Visa sponsorship!<br/>Full time / benefited<br/><br/>family oriented multifaceted health care organization committed to coordinating and providing a continuum of health care services to our residents and visitors. We offer a full range of clinical services to everyone in this region. We take great pride in providing excellence and service to our communities, in a manner that is compassionate and competent.<br/><br/>Full-time, salaried position, based on WRVU. Outpatient/Inpatient practice setting with 3 days per week outpatient and one 72 hour hospitalist shift per month including PA/NP support at night.<br/><br/>Expect to see 20 births per year.<br/><br/>Hospital housing (if available) may be provided free of charge for 3 months.<br/><br/>MD Medical Doctor Physician Internal Med Primary care</div>"}]}